{"3D": {"2311.00425": "|**2023-11-01**|**Neural Implicit Field Editing Considering Object-environment Interaction**|基于神经隐场的三维场景编辑方法得到了广泛的关注。它在三维编辑任务中取得了优异的效果。然而，现有的方法通常将对象和场景环境之间的交互融合在一起。场景外观（如阴影）的更改无法在渲染视图中显示。在本文中，我们提出了一种对象和场景环境交互感知（OSI感知）系统，这是一种考虑对象和场景-环境交互的新型双流神经渲染系统。为了从混合汤中获得照明条件，该系统采用内分解方法成功地分离了物体与场景环境之间的相互作用。为了研究对象级编辑任务对场景外观的相应变化，我们引入了一种深度图引导的场景修复方法和点匹配策略的阴影渲染方法。大量实验表明，我们的新型流水线在场景编辑任务中产生了合理的外观变化。在新的视图合成任务中，它还实现了具有竞争力的渲染质量。 et.al.|[2311.00425](http://arxiv.org/abs/2311.00425)|null|\n", "2310.20251": "|**2023-10-31**|**An Implementation of Multimodal Fusion System for Intelligent Digital Human Generation**|随着人工智能（AI）的快速发展，数字人越来越受到关注，并有望在多个行业实现广泛应用。那么，现有的大多数数字人仍然依赖于设计师的手动建模，这是一个繁琐的过程，而且开发周期很长。因此，面对数字人的崛起，迫切需要一个与人工智能相结合的数字人生成系统来提高开发效率。本文提出了一种多模态融合的智能数字人生成系统的实现方案。具体地，将文本、语音和图像作为输入，并使用大语言模型（LLM）、声纹提取和文本到语音转换技术来合成交互式语音。然后对输入图像进行年龄变换，并选择合适的图像作为驾驶图像。然后，通过数字人驱动、新颖的视图合成和智能着装技术，实现了数字人视频内容的修改和生成。最后，我们通过风格转换、超分辨率和质量评估来增强用户体验。实验结果表明，该系统能够有效地实现数字人的生成。相关代码发布于https://github.com/zyj-2000/CUMT_2D_PhotoSpeaker. et.al.|[2310.20251](http://arxiv.org/abs/2310.20251)|null|\n", "2310.19784": "|**2023-10-30**|**CustomNet: Zero-shot Object Customization with Variable-Viewpoints in Text-to-Image Diffusion Models**|将定制对象合并到图像生成中是文本到图像生成的一个有吸引力的特征。然而，现有的基于优化和基于编码器的方法受到诸如耗时优化、身份保存不足和普遍的复制粘贴效应等缺点的阻碍。为了克服这些限制，我们引入了CustomNet，这是一种新的对象定制方法，它将3D新视图合成功能明确地结合到对象定制过程中。这种集成有助于调整空间位置关系和视点，产生不同的输出，同时有效地保持对象身份。此外，我们引入了精细的设计，通过文本描述或特定的用户定义图像实现位置控制和灵活的背景控制，克服了现有3D新颖视图合成方法的局限性。我们进一步利用数据集构建管道，可以更好地处理真实世界的对象和复杂的背景。有了这些设计，我们的方法方便了零样本对象的定制，而无需测试时间优化，可以同时控制视点、位置和背景。因此，我们的CustomNet确保增强身份保护，并产生多样化、和谐的输出。 et.al.|[2310.19784](http://arxiv.org/abs/2310.19784)|null|\n", "2310.18999": "|**2023-10-31**|**DynPoint: Dynamic Neural Point For View Synthesis**|神经辐射场的引入极大地提高了单目视频视图合成的有效性。然而，现有算法在处理不受控制或冗长的场景时面临困难，并且需要针对每个新场景的大量训练时间。为了解决这些限制，我们提出了DynPoint，这是一种算法，旨在促进无约束单眼视频的新视图的快速合成。DynPoint不是将整个场景信息编码为潜在表示，而是专注于预测相邻帧之间的显式3D对应关系，以实现信息聚合。具体地，这种对应预测是通过估计帧之间一致的深度和场景流信息来实现的。随后，通过构建分层神经点云，利用所获取的对应关系将信息从多个参考帧聚合到目标帧。所得到的框架使得能够对目标帧的期望视图进行快速且准确的视图合成。所获得的实验结果表明，与先前的方法相比，我们提出的方法大大加快了训练时间，通常是一个数量级，同时产生了可比的结果。此外，我们的方法在处理长持续时间视频时表现出强大的鲁棒性，而无需学习视频内容的规范表示。 et.al.|[2310.18999](http://arxiv.org/abs/2310.18999)|null|\n", "2310.17994": "|**2023-10-27**|**ZeroNVS: Zero-Shot 360-Degree View Synthesis from a Single Real Image**|我们介绍了一种3D感知扩散模型ZeroNVS，用于野外场景的单图像新颖视图合成。虽然现有的方法是为具有遮罩背景的单个对象设计的，但我们提出了新的技术来解决具有复杂背景的野外多对象场景带来的挑战。具体来说，我们在捕捉以对象为中心、室内和室外场景的混合数据源上训练生成先验。为了解决深度尺度模糊等数据混合问题，我们提出了一种新的相机条件参数化和归一化方案。此外，我们观察到，在360度场景的提取过程中，分数提取采样（SDS）倾向于截断复杂背景的分布，并提出了“SDS锚定”来提高合成新视图的多样性。我们的模型在零样本设置中的DTU数据集上的LPIPS中设置了新的最先进的结果，甚至优于专门在DTU上训练的方法。我们进一步将具有挑战性的Mip-NeRF 360数据集作为单图像新视图合成的新基准，并在该设置中展示了强大的性能。我们的代码和数据位于http://kylesargent.github.io/zeronvs/ et.al.|[2310.17994](http://arxiv.org/abs/2310.17994)|null|\n", "2310.17880": "|**2023-10-27**|**Reconstructive Latent-Space Neural Radiance Fields for Efficient 3D Scene Representations**|神经辐射场（NeRF）已被证明是强大的3D表示，能够对复杂场景进行高质量的新颖视图合成。虽然NeRF已经应用于图形、视觉和机器人，但渲染速度慢和特有的视觉伪影问题阻碍了在许多用例中的采用。在这项工作中，我们研究了将自动编码器（AE）与NeRF相结合，其中潜在特征（而不是颜色）被渲染，然后进行卷积解码。由此产生的潜在空间NeRF可以产生比标准颜色空间NeRF质量更高的新颖视图，因为AE可以校正某些视觉伪影，同时渲染速度快三倍以上。我们的工作与提高NeRF效率的其他技术正交。此外，我们可以通过缩小AE架构来控制效率和图像质量之间的权衡，在性能下降很小的情况下实现13倍以上的渲染速度。我们希望我们的方法能够为下游任务形成高效但高保真的3D场景表示的基础，尤其是在保持可微性很有用的情况下，就像在许多需要持续学习的机器人场景中一样。 et.al.|[2310.17880](http://arxiv.org/abs/2310.17880)|null|\n", "2310.16832": "|**2023-10-26**|**LightSpeed: Light and Fast Neural Light Fields on Mobile Devices**|由于计算能力和存储空间有限，移动设备上的实时新视图图像合成是令人望而却步的。在移动设备上使用体积渲染方法（如NeRF及其衍生物）是不合适的，因为体积渲染的计算成本很高。另一方面，神经光场表示的最新进展在移动设备上显示出了有希望的实时视图合成结果。神经光场方法学习从光线表示到像素颜色的直接映射。光线表示的当前选择是分层光线采样或Plucker坐标，忽略了经典的光板（两平面）表示，这是在光场视图之间插值的首选表示。在这项工作中，我们发现使用光板表示是学习神经光场的有效表示。更重要的是，它是一种较低维的光线表示，使我们能够使用训练和渲染速度明显更快的特征网格来学习4D光线空间。尽管主要是为正面视图设计的，但我们表明，光板表示可以使用分而治之的策略进一步扩展到非正面场景。与以前的光场方法相比，我们的方法提供了卓越的渲染质量，并显著改善了渲染质量和速度之间的平衡。 et.al.|[2310.16832](http://arxiv.org/abs/2310.16832)|**[link](https://github.com/lightspeed-r2l/lightspeed)**|\n", "2310.16831": "|**2023-10-28**|**PERF: Panoramic Neural Radiance Field from a Single Panorama**|神经辐射场（NeRF）在给定多视点图像的新视点合成方面取得了实质性进展。最近，一些工作试图从具有3D先验的单个图像中训练NeRF。它们主要关注具有少量遮挡的有限视场，这极大地限制了它们在具有大尺寸遮挡的真实世界360度全景场景中的可扩展性。在本文中，我们提出了PERF，这是一种360度新颖的视图合成框架，它从单个全景训练全景神经辐射场。值得注意的是，PERF允许在复杂场景中进行3D漫游，而无需昂贵且乏味的图像采集。为了实现这一目标，我们提出了一种新的协作RGBD修复方法和一种渐进的修复和擦除方法，以将360度2D场景提升为3D场景。具体而言，我们首先预测全景深度图作为给定单个全景的初始化，并使用体绘制重建可见的3D区域。然后，我们在NeRF中引入了一种协作的RGBD修复方法，用于从随机视图中完成RGB图像和深度图，该方法源自RGB稳定扩散模型和单目深度估计器。最后，我们介绍了一种修复和擦除策略，以避免新采样视图和参考视图之间的几何不一致。这两个组件在统一的优化框架中集成到NeRF的学习中，并取得了有希望的结果。在Replica和野外新数据集PERF上进行的大量实验证明了我们的PERF优于最先进的方法。我们的PERF可以广泛用于真实世界的应用，如全景到3D、文本到3D和3D场景风格化应用。项目页面和代码可在https://perf-project.github.io/和https://github.com/perf-project/PeRF. et.al.|[2310.16831](http://arxiv.org/abs/2310.16831)|**[link](https://github.com/perf-project/PeRF)**|\n", "2310.16383": "|**2023-10-25**|**Open-NeRF: Towards Open Vocabulary NeRF Decomposition**|在本文中，我们解决了从开放词汇中将神经辐射场（NeRF）分解为对象的挑战，这是三维重建和视图合成中对象操作的关键任务。当前的NeRF分解技术涉及处理开放词汇查询的灵活性和3D分割的准确性之间的权衡。我们提出了开放词汇嵌入式神经辐射场（Open NeRF），它利用了大规模现成的分割模型，如Segment Anything Model（SAM），并引入了一种具有分层嵌入的集成和提取范式，以实现开放词汇查询的灵活性和3D分割的准确性。Open NeRF首先利用大规模基础模型从不同的角度生成分层2D掩模方案。然后，通过跟踪方法将这些建议对齐，并将其集成在3D空间中，随后将其提取到3D领域中。这一过程确保了从不同角度对对象的一致识别和粒度，即使在涉及遮挡和模糊特征的具有挑战性的场景中也是如此。我们的实验结果表明，在开放词汇场景中，所提出的Open NeRF优于最先进的方法，如LERF\\cite{LERF}和FFD\\cite{FFD}。Open NeRF为NeRF分解提供了一个很有前途的解决方案，以开放词汇查询为指导，在开放世界3D场景中实现机器人和视觉语言交互的新应用。 et.al.|[2310.16383](http://arxiv.org/abs/2310.16383)|null|\n", "2310.16167": "|**2023-10-24**|**iNVS: Repurposing Diffusion Inpainters for Novel View Synthesis**|我们提出了一种从单一源图像生成一致新颖视图的方法。我们的方法侧重于最大限度地重用源图像中的可见像素。为了实现这一点，我们使用单目深度估计器，将可见像素从源视图转移到目标视图。从预先训练的2D修复扩散模型开始，我们在大规模Ob厌恶数据集上训练我们的方法来学习3D对象先验。在训练时，我们使用了一种基于核线的新型掩蔽机制来进一步提高我们的方法的质量。这使得我们的框架能够对各种对象执行零样本新颖的视图合成。我们在三个具有挑战性的数据集上评估了我们框架的零样本能力：谷歌扫描对象、光线跟踪多视图和3D中的常见对象。查看我们的网页了解更多详细信息：https://yashkant.github.io/invs/ et.al.|[2310.16167](http://arxiv.org/abs/2310.16167)|null|\n"}, "3D Reconstruction": {"2311.00483": "|**2023-11-01**|**DEFN: Dual-Encoder Fourier Group Harmonics Network for Three-Dimensional Macular Hole Reconstruction with Stochastic Retinal Defect Augmentation and Dynamic Weight Composition**|黄斑裂孔的空间和定量参数对诊断、手术选择和术后监测至关重要。黄斑的诊断和治疗在很大程度上依赖于空间和定量数据，但这些数据的稀缺阻碍了深度学习技术在有效分割和实时3D重建方面的进展。为了应对这一挑战，我们收集了世界上最大的黄斑裂孔数据集，用于黄斑裂孔增强的视网膜OCT（ROME-3914）和用于视网膜分割的综合档案（CARS-30k），这两个数据集都经过了专业注释。此外，我们还开发了一个创新的3D分割网络，即双编码器FuGH网络（DEFN），它集成了三个创新模块：傅立叶群谐波（FuGH）、简化三维空间注意力（S3DSA）和谐波挤压和激励模块（HSE）。这三个模块协同过滤噪声，降低计算复杂度，强调细节特征，增强网络的表示能力。我们还提出了一种新的数据增强方法，随机视网膜缺陷注入（SRDI）和网络优化策略DynamicWeightCompose（DWC），以进一步提高DEFN的性能。与13个基线相比，我们的DEFN显示出最佳性能。我们还提供精确的3D视网膜重建和定量指标，为眼科医生带来革命性的诊断和治疗决策工具，有望彻底重塑难以治疗的黄斑变性的诊断和处理模式。源代码可在以下位置公开获取：https://github.com/IIPL-HangzhouDianUniversity/DEFN-Pytorch. et.al.|[2311.00483](http://arxiv.org/abs/2311.00483)|**[link](https://github.com/iipl-hangzhoudianziuniversity/defn-pytorch)**|\n", "2311.00457": "|**2023-11-01**|**Single-view 3D Scene Reconstruction with High-fidelity Shape and Texture**|由于现有方法的局限性，从单视图图像重建详细的3D场景仍然是一项具有挑战性的任务，这些方法主要关注几何形状恢复，忽略对象外观和精细形状细节。为了应对这些挑战，我们提出了一种新的框架，用于从单视图图像中同时高保真地恢复对象形状和纹理。我们的方法利用所提出的单视图神经隐式形状和辐射场（SSR）表示来利用显式3D形状监督和颜色、深度和表面法线图像的体积渲染。为了克服部分观察下的形状-外观模糊性，我们引入了一个包含3D和2D监督的两阶段学习课程。我们的框架的一个显著特点是能够生成细粒度纹理网格，同时将渲染功能无缝集成到单视图3D重建模型中。这种集成不仅使3D-FRONT和Pix3D数据集上的纹理3D对象重建分别提高了27.7%和11.6%，而且还支持从新视点渲染图像。除了单个对象之外，我们的方法还有助于将对象级表示组合为灵活的场景表示，从而实现整体场景理解和3D场景编辑等应用。我们进行了大量的实验来证明我们的方法的有效性。 et.al.|[2311.00457](http://arxiv.org/abs/2311.00457)|null|\n", "2311.00134": "|**2023-10-31**|**Joint Depth Prediction and Semantic Segmentation with Multi-View SAM**|针对单目图像，对联合深度和分割预测的多任务方法进行了深入研究。然而，来自单个视图的预测本质上是有限的，而在许多机器人应用中可以使用多个视图。另一方面，基于视频的全3D方法需要大量的帧来执行重建和分割。通过这项工作，我们提出了一种用于深度预测的多视图立体（MVS）技术，该技术得益于分段任意模型（SAM）丰富的语义特征。这种增强的深度预测反过来又作为我们基于Transformer的语义分割解码器的提示。我们在ScanNet数据集的定量和定性研究中报告了这两项任务的互利性。我们的方法始终优于单任务MVS和分割模型，以及多任务单目方法。 et.al.|[2311.00134](http://arxiv.org/abs/2311.00134)|null|\n", "2311.00107": "|**2023-10-31**|**Deep Compressed Learning for 3D Seismic Inversion**|我们考虑了使用极少量震源从叠前数据进行三维地震反演的问题。所提出的解决方案基于压缩感知和机器学习框架的组合，称为压缩学习。该解决方案联合优化了由深度卷积神经网络（DCNN）实现的降维算子和3D反演编码器-解码器。降维是通过学习稀疏二进制传感层来实现的，该层选择可用源的一个子集，然后将所选数据馈送到DCNN以完成回归任务。端到端的学习过程将训练期间使用的地震记录的数量减少了一个数量级，同时保持了与使用整个数据集获得的3D重建质量相当的三维重建质量。 et.al.|[2311.00107](http://arxiv.org/abs/2311.00107)|null|\n", "2310.20117": "|**2023-10-31**|**Refined Equivalent Pinhole Model for Large-scale 3D Reconstruction from Spaceborne CCD Imagery**|在这项研究中，我们提出了一个用于线阵电荷耦合器件（CCD）卫星图像的大规模地表重建管道。虽然主流的基于卫星图像的重建方法表现得非常好，但有理函数模型（RFM）受到一些限制。例如，RFM没有严格的物理解释，与针孔成像模型有很大不同；因此，它不能直接应用于基于学习的三维重建网络和计算机视觉中更新颖的重建管道。因此，在本研究中，我们介绍了一种方法，其中RFM等效于针孔相机模型（PCM），这意味着使用针孔相机的内部和外部参数，而不是有理多项式系数参数。然后，我们首次推导出该等效针孔模型的误差公式，证明了图像大小对重建精度的影响。此外，我们提出了一个多项式图像细化模型，通过最小二乘法最小化等效误差。实验使用四个图像数据集进行：WHU-TLC、DFC2019、ISPRS-ZY3和GF7。结果表明，重建精度与图像大小成正比。我们的多项式图像细化模型显著提高了重建的准确性和完整性，并对更大尺度的图像实现了更显著的改进。 et.al.|[2310.20117](http://arxiv.org/abs/2310.20117)|null|\n", "2310.19188": "|**2023-10-29**|**3DMiner: Discovering Shapes from Large-Scale Unannotated Image Datasets**|我们介绍了3DMiner——一种从具有挑战性的大规模未标记图像数据集中挖掘3D形状的管道。与其他无监督的3D重建方法不同，我们假设，在一个足够大的数据集中，必须存在形状相似但背景、纹理和视点不同的对象图像。我们的方法利用学习自监督图像表示的最新进展，对具有几何相似形状的图像进行聚类，并找到它们之间的常见图像对应关系。然后，我们利用这些对应关系来获得粗略的相机估计，作为束调整的初始化。最后，对于每个图像聚类，我们应用渐进束调整重建方法来学习表示底层形状的神经占据场。我们表明，该程序对之前步骤中引入的几种类型的错误（例如，错误的相机姿势、包含不同形状的图像等）是稳健的，使我们能够获得野外图像的形状和姿势注释。当使用Pix3D椅子的图像时，我们的方法能够在定量和定性方面产生比最先进的无监督3D重建技术更好的结果。此外，我们还展示了3DMiner如何通过重建LAION-5B数据集中图像中的形状来应用于野外数据。项目页面：https://ttchengab.github.io/3dminerOfficial et.al.|[2310.19188](http://arxiv.org/abs/2310.19188)|null|\n", "2310.18890": "|**2023-10-29**|**Towards Generalized Multi-stage Clustering: Multi-view Self-distillation**|现有的多阶段聚类方法从多个视图中独立地学习显著特征，然后执行聚类任务。特别是，多视图集群（MVC）在多视图或多模式场景中引起了很多关注。MVC旨在从多个视图中探索通用语义和伪标签，并以自监督的方式进行聚类。然而，受噪声数据和特征学习不足的限制，这种聚类范式会产生过于自信的伪标签，错误地引导模型产生不准确的预测。因此，希望有一种方法可以在多阶段聚类中纠正这种伪标签错误行为，以避免偏差累积。为了缓解过度自信的伪标签的影响，提高模型的泛化能力，本文提出了一种新的多阶段深度MVC框架，引入多视图自蒸馏（DistilMVC）来提取标签分布的暗知识。具体来说，在不同层次的特征子空间中，我们通过对比学习来探索多个视图的共同语义，并通过最大化视图之间的相互信息来获得伪标签。此外，教师网络负责将伪标签提取到暗知识中，监督学生网络并提高其预测能力以增强鲁棒性。在真实世界的多视图数据集上进行的大量实验表明，我们的方法比最先进的方法具有更好的聚类性能。 et.al.|[2310.18890](http://arxiv.org/abs/2310.18890)|null|\n", "2310.18456": "|**2023-10-27**|**Understanding the effect of curvature on the magnetization reversal of three-dimensional nanohelices**|理解三维（3D）纳米结构中几何结构和磁性之间的相互作用对于理解畴壁（DW）形成和钉扎的基本物理具有重要意义。在这里，我们使用聚焦电子束诱导沉积来制备具有随高度增加的螺旋曲率的磁性纳米螺旋。利用电子断层扫描和洛伦兹透射电子显微镜，我们重建了纳米螺旋的三维结构和磁化强度。然后从断层图像重建中量化纳米螺旋的表面曲率、螺旋曲率和扭转。此外，通过使用实验三维重建作为微磁模拟的输入，我们可以揭示表面和螺旋曲率对磁反转机制的影响。因此，我们可以将3D纳米螺旋的磁性行为与其实验结构直接关联起来。这些结果证明了如何利用纳米螺旋中几何形状的控制来稳定DW和控制纳米结构对所施加磁场的响应。 et.al.|[2310.18456](http://arxiv.org/abs/2310.18456)|null|\n", "2310.16383": "|**2023-10-25**|**Open-NeRF: Towards Open Vocabulary NeRF Decomposition**|在本文中，我们解决了从开放词汇中将神经辐射场（NeRF）分解为对象的挑战，这是三维重建和视图合成中对象操作的关键任务。当前的NeRF分解技术涉及处理开放词汇查询的灵活性和3D分割的准确性之间的权衡。我们提出了开放词汇嵌入式神经辐射场（Open NeRF），它利用了大规模现成的分割模型，如Segment Anything Model（SAM），并引入了一种具有分层嵌入的集成和提取范式，以实现开放词汇查询的灵活性和3D分割的准确性。Open NeRF首先利用大规模基础模型从不同的角度生成分层2D掩模方案。然后，通过跟踪方法将这些建议对齐，并将其集成在3D空间中，随后将其提取到3D领域中。这一过程确保了从不同角度对对象的一致识别和粒度，即使在涉及遮挡和模糊特征的具有挑战性的场景中也是如此。我们的实验结果表明，在开放词汇场景中，所提出的Open NeRF优于最先进的方法，如LERF\\cite{LERF}和FFD\\cite{FFD}。Open NeRF为NeRF分解提供了一个很有前途的解决方案，以开放词汇查询为指导，在开放世界3D场景中实现机器人和视觉语言交互的新应用。 et.al.|[2310.16383](http://arxiv.org/abs/2310.16383)|null|\n", "2310.15130": "|**2023-10-23**|**Novel-View Acoustic Synthesis from 3D Reconstructed Rooms**|我们研究了将盲音频记录与3D场景信息相结合用于新视图声学合成的好处。给定2-4个麦克风的音频记录以及包含多个未知声源的场景的3D几何形状和材料，我们估计场景中任何地方的声音。我们确定了新观点声学合成的主要挑战是声源定位、分离和去混响。虽然天真地训练端到端网络无法产生高质量的结果，但我们表明，结合从3D重建房间中导出的房间脉冲响应（RIR）使同一网络能够联合处理这些任务。我们的方法优于为单个任务设计的现有方法，证明了它在利用3D视觉信息方面的有效性。在对Matterport3D NVAS数据集的模拟研究中，我们的模型在源定位方面实现了近乎完美的精度，在源分离和去混响方面实现了26.44dB的PSNR和14.23dB的SDR，在新视图声学合成方面实现了25.55dB的PSNR和14.20dB的SDR。代码、预训练模型和视频结果可在项目网页上获得(https://github.com/apple/ml-nvas3d)。 et.al.|[2310.15130](http://arxiv.org/abs/2310.15130)|**[link](https://github.com/apple/ml-nvas3d)**|\n"}, "Diffusion": {"2311.00685": "|**2023-11-01**|**Phase separation dependent active motion of Janus lipid vesicles**|活性胶体系统已成为未来微型设备的有力竞争者。虽然传统设计已经广泛利用了硬胶体的使用，但细胞启发结构的进步代表了实现自我调节和高功能人工微游泳池的关键途径。在这项工作中，我们制造并驱动Janus脂质囊泡，展示了在交流电场下的可重构运动。巨大的单层囊泡（GUV）在室温下发生自发相分离，导致具有两个不同脂质相的Janus样GUV。我们报道了Janus GUV通过平行电极之间的感应电荷电渗进行的自推进。值得注意的是，受电场影响的脂质膜的流体性质导致不对称对称瞬态，从而导致结构域分析支持的运行和翻滚事件。我们描述了与翻滚事件相关的增强的旋转扩散率，与热重新定向解耦。最后，我们确定了这些囊泡中的货物释放能力和各种形状编码的动态模式。这种以细胞为灵感的结构为创造可移动的人工细胞和可编程微游泳池提供了一种替代途径。 et.al.|[2311.00685](http://arxiv.org/abs/2311.00685)|null|\n", "2311.00647": "|**2023-11-01**|**The Countoscope: Measuring Self and Collective Dynamics without Trajectories**|显微镜现在可以在单个粒子水平上解析复杂的系统，从细胞有机体到单个离子。因此，科学界对从图像中量化粒子动力学有着共同的兴趣。然而，现有的分析技术面临着在密集和异质系统中重建轨迹的挑战，在这些系统中很难准确标记粒子。此外，不可避免的有限实验视野阻碍了对生物或主动系统核心集体效应的测量。受Smoluchowski的启发，我们介绍了一种广泛适用的分析技术，该技术只需通过对有限观察盒中的粒子进行计数即可探测动力学。使用胶体实验、模拟和理论，我们首先证明了波动计数的统计特性可以用于确定自扩散系数，包括流体动力学相互作用的影响，从而减轻了与轨迹重建相关的障碍。我们随后表明，通过增加观察箱的大小，计数自然能够研究集体动力学。使用我们对粒子计数的新分析，我们发现了集体行为的惊人增强，以及与超均匀结构相关的新的基本长度尺度。因此，我们的计数框架Countoscope将实验从有限的视野中解放出来，并实现了有效的集体动力学测量，为研究各种复杂系统开辟了道路。 et.al.|[2311.00647](http://arxiv.org/abs/2311.00647)|null|\n", "2311.00633": "|**2023-11-01**|**Ab initio machine-learning unveils strong anharmonicity in non-Arrhenius self-diffusion of tungsten**|我们提出了一个有效的从头算框架来计算空位介导扩散中过渡态的吉布斯能，包括密度泛函理论水平上的相关热激发。在定制的机器学习原子间势的帮助下，bcc钨原型系统的温度相关空位形成和迁移吉布斯能被证明受到非谐性的强烈影响。作为一个案例研究，这解释了实验观察到的W自扩散的非阿伦尼斯行为的物理起源。自扩散率与实验的良好一致性表明，可以获得准确的从头算扩散数据库。 et.al.|[2311.00633](http://arxiv.org/abs/2311.00633)|null|\n", "2311.00630": "|**2023-11-01**|**Nonequilibrium Green's Function simulation of Cu2O photocathodes for photoelectrochemical hydrogen production**|在这项工作中，我们基于非平衡格林函数（NEGF）形式对光电化学（PEC）水分裂电池的半导体电极进行了模拟。虽然简单PEC电池的性能可以用半经典漂移扩散理论来充分解释，但人们对薄膜电池和纳米结构越来越感兴趣，通常需要进行理论处理，以捕捉影响这些器件中电荷载流子动力学的量子现象。具体而言，我们研究了p型Cu2O电极，并考察了偏压、反应动力学和Cu2O层厚度对产生的光电流的影响。NEGF方程以自洽的方式与泊松方程中的静电势、阳光诱导的光子散射和驱动水分解反应所需的化学过电势相求解。我们表明，NEGF模拟准确地再现了伏安法和阻抗谱测量的实验结果，同时提供了纳米级半导体电极内电荷载流子密度和相应电流的能量分辨解决方案。 et.al.|[2311.00630](http://arxiv.org/abs/2311.00630)|null|\n", "2311.00618": "|**2023-11-01**|**De-Diffusion Makes Text a Strong Cross-Modal Interface**|我们将文本演示为一个强大的跨模态接口。我们的方法不是依赖深度嵌入来连接图像和语言作为界面表示，而是将图像表示为文本，从中我们享受自然语言固有的可解释性和灵活性。我们采用了一种自动编码器，该编码器使用预先训练的文本到图像扩散模型进行解码。编码器被训练为将输入图像转换为文本，然后将文本输入到固定的文本到图像扩散解码器中，以重建原始输入——我们称之为去扩散过程。实验验证了去扩散文本表示图像的准确性和全面性，因此现成的文本到图像工具和LLM可以很容易地将其用于各种多模式任务。例如，单个去扩散模型可以进行泛化，为不同的文本到图像工具提供可转移的提示，并且还可以通过简单地提示具有少量镜头示例的大型语言模型来实现开放式视觉语言任务的新技术状态。 et.al.|[2311.00618](http://arxiv.org/abs/2311.00618)|null|\n", "2311.00613": "|**2023-11-01**|**Controllable Music Production with Diffusion Models and Guidance Gradients**|我们展示了如何使用扩散模型的条件生成来处理44.1kHz立体声音频音乐制作中的各种现实任务，并提供采样时间指导。我们考虑的场景包括音乐音频的延续、修复和再生，在两个不同的音乐曲目之间创建平滑的过渡，以及将所需的风格特征转移到现有的音频剪辑中。我们通过在一个简单的框架中应用采样时的指导来实现这一点，该框架支持重建和分类损失，或两者的任何组合。这种方法确保生成的音频可以匹配其周围的上下文，或者符合相对于任何合适的预训练分类器或嵌入模型指定的类分布或潜在表示。 et.al.|[2311.00613](http://arxiv.org/abs/2311.00613)|null|\n", "2311.00500": "|**2023-11-01**|**Intriguing Properties of Data Attribution on Diffusion Models**|数据归因试图将模型输出追溯到训练数据。随着扩散模型的最新发展，数据归因已成为一个理想的模块，可以正确分配高质量或受版权保护的训练样本的估值，确保数据贡献者得到公平的补偿或信用。为了改善计算可扩展性和有效性之间的权衡，已经提出了几种基于理论的方法来实现数据归因。在这项工作中，我们对归因扩散模型进行了广泛的实验和消融研究，特别关注在CIFAR-10和CelebA上训练的DDPM，以及在ArtBench上微调的稳定扩散模型LoRA。有趣的是，我们报告了反直觉的观察结果，即在线性数据建模得分和反事实评估方面，理论上不合理的归因设计选择在经验上大大优于以前的基线。我们的工作为归因扩散模型提供了一种更有效的方法，而意外的发现表明，至少在非凸环境中，以理论假设为指导的构建可能会导致较差的归因性能。代码可在https://github.com/sail-sg/D-TRAK. et.al.|[2311.00500](http://arxiv.org/abs/2311.00500)|**[link](https://github.com/sail-sg/d-trak)**|\n", "2311.00496": "|**2023-11-01**|**Generating HSR Bogie Vibration Signals via Pulse Voltage-Guided Conditional Diffusion Model**|用于产生真实信号的生成对抗性网络（GANs）已经大大改进了各种物联网（IoT）系统中的故障诊断算法。然而，训练不稳定性和动力学不精确性等挑战限制了它们在高速铁路转向架故障诊断中的应用。为了应对这些挑战，我们引入了脉冲电压引导条件扩散模型（VGCDM）。与传统的隐式GANs不同，VGCDM采用了顺序U-Net架构，便于多阶段去噪扩散生成，这增强了训练稳定性并缓解了收敛问题。VGCDM还通过交叉注意机制结合了控制脉冲电压，以确保振动与电压信号的一致性，增强了条件扩散模型的渐进可控性。因此，仅对控制电压进行直接采样，确保从高斯噪声到振动信号的有效转换。即使在速度随时间变化的情况下，这种适应性仍然很强。为了验证其有效性，我们使用SQ数据集和高仿真高铁转向架数据集进行了两个案例研究。我们的实验结果明确证实，VGCDM优于其他生成模型，实现了最佳的RSME、PSNR和FSCS，显示了其在条件高铁转向架振动信号生成方面的优势。如需访问，我们的代码可在https://github.com/xuanliu2000/VGCDM. et.al.|[2311.00496](http://arxiv.org/abs/2311.00496)|null|\n", "2311.00474": "|**2023-11-01**|**Diffusion models for probabilistic programming**|我们提出了扩散模型变分推理（DMVI），这是一种在概率规划语言（PPL）中进行自动近似推理的新方法。DMVI利用扩散模型作为真实后验分布的变分近似，通过推导贝叶斯建模中使用的边际似然目标的新边界。DMVI易于实现，允许在PPL中进行无障碍推理，而没有例如使用归一化流的变分推理的缺点，并且不对底层神经网络模型进行任何约束。我们在一组常见的贝叶斯模型上评估了DMVI，并表明其后验推断通常比PPL中使用的当代方法更准确，同时具有类似的计算成本，并且需要较少的手动调整。 et.al.|[2311.00474](http://arxiv.org/abs/2311.00474)|null|\n", "2311.00469": "|**2023-11-01**|**Dual Conditioned Diffusion Models for Out-Of-Distribution Detection: Application to Fetal Ultrasound Videos**|分布外（OOD）检测对于通过检测不属于训练分布的样本来提高机器学习模型的可靠性至关重要。在某些任务中有效地检测OOD样本可能会带来挑战，因为在分布（ID）中存在显著的异质性，以及ID和OOD类之间的高度结构相似性。例如，当在胎儿超声视频中检测心脏视图时，心脏和其他解剖结构（如腹部）之间存在高度的结构相似性，并且由于心脏在每个视图中具有5个不同的视图和结构变化，因此分布变化较大。为了在这种情况下检测OOD样本，所得到的模型应该推广到解剖结构内的变化，同时拒绝类似的OOD样本。在本文中，我们引入了双重条件扩散模型（DCDM），其中我们基于分布类内信息和输入图像的潜在特征来条件模型，用于基于重构的OOD检测。这限制了模型的生成流形以生成在结构和语义上与in分布内的图像相似的图像。所提出的模型优于参考方法，准确度提高了12%，精度提高了22%，F1得分提高了8%。 et.al.|[2311.00469](http://arxiv.org/abs/2311.00469)|null|\n"}, "NeRF": {"2310.20679": "|**2023-10-31**|**Latent Field Discovery In Interacting Dynamical Systems With Neural Fields**|交互对象的系统通常在控制其动力学的场效应的影响下进化，然而以前的工作已经从这种效应中抽象出来，并假设系统在真空中进化。在这项工作中，我们专注于发现这些场，并仅从观察到的动力学中推断它们，而不直接观察它们。我们将潜在力场的存在理论化，并提出神经场来学习它们。由于观测到的动力学构成了局部物体相互作用和全局场效应的净效应，最近流行的等变网络不适用，因为它们无法捕捉全局信息。为了解决这一问题，我们建议将局部对象交互（$\\mathrm｛SE｝（n）$等变并依赖于相对状态）与外部全局场效应（依赖于绝对状态）区分开来。我们用等变图网络对交互进行建模，并将它们与神经场结合在一个集成场力的新型图网络中。我们的实验表明，我们可以准确地发现带电粒子环境、交通场景和引力n体问题中的潜在场，并有效地利用它们来学习系统和预测未来的轨迹。 et.al.|[2310.20679](http://arxiv.org/abs/2310.20679)|**[link](https://github.com/mkofinas/aether)**|\n", "2310.19464": "|**2023-10-30**|**Generative Neural Fields by Mixtures of Neural Implicit Functions**|我们提出了一种新的方法来学习由隐式基网络的线性组合表示的生成神经场。我们的算法通过进行元学习或采用自动解码范式，在潜在空间中以隐式神经表示的形式学习基网络及其系数。所提出的方法通过增加基网络的数量来容易地扩大生成神经场的容量，同时通过加权模型平均来保持推理网络的大小较小。因此，使用该模型对实例进行采样在延迟和内存占用方面是有效的。此外，我们为目标任务定制了去噪扩散概率模型，以对潜在的混合系数进行采样，这使我们的最终模型能够有效地生成看不见的数据。实验表明，我们的方法在图像、体素数据和NeRF场景的不同基准上实现了有竞争力的生成性能，而无需对特定模态和域进行复杂的设计。 et.al.|[2310.19464](http://arxiv.org/abs/2310.19464)|null|\n", "2310.15907": "|**2023-10-24**|**LiCROM: Linear-Subspace Continuous Reduced Order Modeling with Neural Fields**|线性降阶建模（ROM）通过使用简化的运动学表示来近似系统的行为，从而简化了复杂的模拟。通常，ROM在使用特定空间离散化创建的输入模拟上进行训练，然后用于使用相同的离散化加速模拟。这种离散化依赖性是有限制的。独立于特定的离散化将提供在训练数据中混合和匹配网格分辨率、连通性和类型（四面体、六面体）的灵活性；以在训练过程中看不到的新颖离散化来加速模拟；以及加速在时间上或参数化地改变离散化的自适应模拟。我们提出了一种灵活的、独立于离散化的降阶建模方法。与传统ROM一样，我们将配置表示为位移场的线性组合。与传统的ROM不同，我们的位移场是从参考域上的每个点到相应位移矢量的连续映射；这些映射被表示为隐式神经场。使用线性连续ROM（LiCROM），我们的训练集可以包括经历多个加载条件的多个几何体，与它们的离散化无关。这为降阶建模的新应用打开了大门。我们现在可以加速在运行时修改几何体的模拟，例如通过切割、打孔，甚至交换整个网格。我们还可以加速对训练中看不见的几何形状的模拟。我们演示了一次性泛化，在单个几何体上进行训练，然后模拟各种看不见的几何体。 et.al.|[2310.15907](http://arxiv.org/abs/2310.15907)|null|\n", "2310.07522": "|**2023-10-12**|**S4C: Self-Supervised Semantic Scene Completion with Neural Fields**|三维语义场景理解是计算机视觉中的一个基本挑战。它使移动代理能够自主规划和导航任意环境。SSC将这一挑战形式化为从场景的稀疏观测中联合估计密集的几何结构和语义信息。当前的SSC方法通常基于聚合的激光雷达扫描在3D地面实况上进行训练。这一过程依赖于特殊的传感器和手工注释，这些传感器和注释成本高昂且规模不大。为了克服这个问题，我们的工作提出了第一种称为S4C的SSC自监督方法，该方法不依赖于3D地面实况数据。我们提出的方法可以从单个图像重建场景，并且只依赖于训练期间从现成的图像分割网络生成的视频和伪分割地面实况。与使用离散体素网格的现有方法不同，我们将场景表示为隐式语义场。该公式允许查询相机截锥体内的任何点的占用率和语义类。我们的架构是通过基于渲染的自监督损失进行训练的。尽管如此，我们的方法实现了接近于完全监督的最先进方法的性能。此外，我们的方法表现出强大的泛化能力，可以为遥远的视点合成准确的分割图。 et.al.|[2310.07522](http://arxiv.org/abs/2310.07522)|null|\n", "2310.04787": "|**2023-10-07**|**HI-SLAM: Monocular Real-time Dense Mapping with Hybrid Implicit Fields**|在这封信中，我们提出了一个基于神经场的实时单目映射框架，用于精确和密集的同时定位和映射（SLAM）。最近的神经映射框架显示出有希望的结果，但依赖于RGB-D或姿势输入，或者无法实时运行。为了解决这些局限性，我们的方法将密集SLAM与神经隐式场相结合。具体来说，我们的密集SLAM方法运行并行跟踪和全局优化，而基于神经场的映射是基于最新的SLAM估计逐步构建的。为了有效地构造神经场，我们采用了多分辨率网格编码和符号距离函数（SDF）表示。这使我们能够始终保持地图的最新状态，并通过循环关闭立即适应全球更新。为了全局一致性，我们提出了一种有效的基于Sim（3）的姿态图束调整（PGBA）方法来运行在线闭环并减轻姿态和尺度漂移。为了进一步提高深度精度，我们结合了学习的单目深度先验。我们提出了一种新的深度和尺度联合调整（JDSA）模块来解决深度先验中固有的尺度模糊性。对合成和真实世界数据集的广泛评估验证了我们的方法在准确性和地图完整性方面优于现有方法，同时保持了实时性能。 et.al.|[2310.04787](http://arxiv.org/abs/2310.04787)|null|\n", "2310.03861": "|**2023-10-05**|**Variational Barycentric Coordinates**|我们提出了一种变分技术来优化广义重心坐标，与现有模型相比，该技术提供了额外的控制。先前的工作使用网格或闭式公式表示重心坐标，在实践中限制了目标函数的选择。相反，我们使用神经场直接参数化连续函数，该函数将多面体内部的任何坐标映射到其重心坐标。这个公式是通过我们对重心坐标的理论表征实现的，这使我们能够构建将有效坐标的整个函数类参数化的神经场。我们使用各种目标函数展示了我们模型的灵活性，包括多重光滑性和变形感知能量；作为补充，我们还提出了数学上合理的方法来测量和最小化目标，如不连续神经场的总变化。我们提供了一个实用的加速策略，对我们的算法进行了彻底的验证，并展示了几个应用。 et.al.|[2310.03861](http://arxiv.org/abs/2310.03861)|null|\n", "2310.03624": "|**2023-10-05**|**High-Degrees-of-Freedom Dynamic Neural Fields for Robot Self-Modeling and Motion Planning**|机器人自模型是机器人物理形态的任务不可知表示，在没有经典几何运动学模型的情况下，可用于运动规划任务。特别是，当后者难以设计或机器人的运动学发生意外变化时，人类自由的自我建模是真正自主智能体的必要特征。在这项工作中，我们利用神经场使机器人能够将其运动学自建模为仅从带有相机姿势和配置的2D图像中学习的神经隐式查询模型。这使得比依赖于深度图像或几何知识的现有方法具有更大的适用性。为此，除了课程数据采样策略外，我们还提出了一种新的基于编码器的神经密度场架构，用于高自由度（DOF）条件下的动态对象中心场景。在7自由度机器人测试装置中，学习的自模型实现了机器人工作空间尺寸2%的倒角-L2距离。作为一个示例性的下游应用程序，我们展示了该模型在运动规划任务中的能力。 et.al.|[2310.03624](http://arxiv.org/abs/2310.03624)|null|\n", "2310.01140": "|**2023-10-02**|**Neural Processing of Tri-Plane Hybrid Neural Fields**|在用于存储和通信3D数据的神经场的吸引人的特性的驱动下，直接处理它们以解决分类和零件分割等任务的问题已经出现，并在最近的工作中进行了研究。早期的方法使用由在整个数据集上训练的共享网络参数化的神经场，实现了良好的任务性能，但牺牲了重建质量。为了改进后者，后来的方法侧重于参数化为大型多层感知器（MLP）的单个神经场，然而，由于权重空间的高维性、固有的权重空间对称性和对随机初始化的敏感性，这些神经元场的处理具有挑战性。因此，结果明显不如通过处理显式表示（例如点云或网格）所获得的结果。与此同时，混合表示，特别是基于三平面的混合表示，已经成为实现神经场的一种更有效的替代方案，但其直接处理尚未得到研究。在本文中，我们证明了三平面离散数据结构编码了丰富的信息，标准的深度学习机器可以有效地处理这些信息。我们定义了一个广泛的基准，涵盖了一组不同的字段，如占用率、有符号/无符号距离，以及首次定义的辐射字段。在处理具有相同重建质量的字段时，我们实现的任务性能远远优于处理大型MLP的框架，并且首次几乎与处理显式表示的架构不相上下。 et.al.|[2310.01140](http://arxiv.org/abs/2310.01140)|**[link](https://github.com/CVLAB-Unibo/triplane_processing)**|\n", "2309.15977": "|**2023-09-27**|**Neural Acoustic Context Field: Rendering Realistic Room Impulse Response With Neural Fields**|房间脉冲响应（RIR）测量声音在环境中的传播，对于合成给定环境下的高保真音频至关重要。一些先前的工作已经提出将RIR表示为声音发射器和接收器位置的神经场函数。然而，这些方法没有充分考虑音频场景的声学特性，导致性能不令人满意。这封信提出了一种新的神经声学上下文场方法，称为NACF，通过利用多个声学上下文（如几何结构、材料特性和空间信息）来参数化音频场景。在RIR的独特性质，即时间不光滑性和单调能量衰减的驱动下，我们设计了一个时间相关模块和多尺度能量衰减准则。实验结果表明，NACF的性能显著优于现有的基于字段的方法。请访问我们的项目页面了解更多定性结果。 et.al.|[2309.15977](http://arxiv.org/abs/2309.15977)|null|\n", "2309.15848": "|**2023-09-27**|**SHACIRA: Scalable HAsh-grid Compression for Implicit Neural Representations**|隐式神经表示（INR）或神经场已成为编码多媒体信号（如图像和辐射场）同时保持高质量的流行框架。最近，Instant NGP提出的可学习特征网格通过用特征向量的多分辨率查找表和更小的神经网络取代大型神经网络，在训练和INR采样方面实现了显著的加速。然而，这些功能网格是以大量内存消耗为代价的，这可能是存储和流应用程序的瓶颈。在这项工作中，我们提出了SHACIRA，这是一个简单而有效的任务无关框架，用于压缩这种特征网格，而不需要额外的事后修剪/量化阶段。我们用量化的潜在权重对特征网格进行重新参数化，并在潜在空间中应用熵正则化，以在各个领域实现高水平的压缩。在由图像、视频和辐射场组成的不同数据集上的定量和定性结果表明，我们的方法优于现有的INR方法，而不需要任何大型数据集或特定领域的启发式方法。我们的项目页面可在http://shacira.github.io。 et.al.|[2309.15848](http://arxiv.org/abs/2309.15848)|null|\n"}}