{"avatar": {"2401.18084": "|**2024-01-31**|**Binding Touch to Everything: Learning Unified Multimodal Tactile Representations**|将触摸与其他模态相关联的能力对人类和计算系统具有巨大的意义。然而，由于昂贵的数据收集过程和非标准化的传感器输出，使用触摸的多模式学习仍然具有挑战性。我们介绍了UniTouch，这是一种用于连接到多种模态（包括视觉、语言和声音）的基于视觉的触摸传感器的统一触觉模型。我们通过将UniTouch嵌入与已经与各种其他模态相关联的预训练图像嵌入对齐来实现这一点。我们进一步提出了可学习的传感器特定令牌，允许模型同时从一组异构触觉传感器中学习。UniTouch能够在零样本设置下执行各种触摸感应任务，从机器人抓取预测到触摸图像问答。据我们所知，UniTouch是第一家展示此类功能的公司。项目页面：https://cfeng16.github.io/UniTouch/ et.al.|[2401.18084](http://arxiv.org/abs/2401.18084)|null|\n", "2401.18080": "|**2024-01-31**|**Strong Bow Shocks: Turbulence and An Exact Self-Similar Asymptotic**|我们证明，强弓形激波在头部附近是湍流和非普遍的，但在下游是普遍稳定、自相似和解析可解流的渐近线。湍流本质上是三维的，并且已经通过三维模拟得到了证实。这种渐近行为通过高分辨率的二维和三维模拟得到了证实，模拟了冷均匀风同时遇到固体球形障碍物和恒星风。这一解决方案与以下方面有关：（i）探测在星际介质中飞行的观测到的高速致密体的运动学特性，例如失控恒星和/或超新星喷出物团块；以及（ii）由一些准周期喷发（QPE）模型调用的约束恒星弓形激波发光。 et.al.|[2401.18080](http://arxiv.org/abs/2401.18080)|null|\n", "2401.18070": "|**2024-01-31**|**Do Language Models Exhibit the Same Cognitive Biases in Problem Solving as Human Learners?**|人们对使用大型语言模型（LLM）作为认知模型越来越感兴趣。出于这些目的，了解LLM对哪些认知特性进行了良好的建模，哪些没有建模是至关重要的。在这项工作中，我们研究了LLM在解决算术单词问题时相对于儿童已知LLM的偏见。通过查阅学习科学文献，我们认为解决问题的过程可以分为三个不同的步骤：文本理解、解决方案规划和解决方案执行。我们为每一个构建测试，以了解这个过程的哪些部分可以通过当前最先进的LLM忠实地建模。我们使用神经符号方法为每个测试生成一组新的单词问题，该方法能够对问题特征进行细粒度控制。我们发现有证据表明，无论有没有指令调整，LLM在文本理解和解决过程的解决方案规划步骤中都表现出类似人类的偏见，但在依赖于问题算术表达式（解决方案执行）的最后一步中却没有。 et.al.|[2401.18070](http://arxiv.org/abs/2401.18070)|null|\n", "2401.18067": "|**2024-01-31**|**Reduced-Order Model of Power Converters to Optimize Power Hardware-In-the-Loop Technology in Dc-Distributed Systems**|电源硬件在环（PHIL）技术为测试存在高功率交换的场景提供了一个强大的工具，在这些场景中，现场测试的性能可能非常复杂或昂贵。当对具有大量组件的系统（例如船上或飞机上的DC分布式系统）进行PHIL模拟时，转换器的切换或平均模型的使用可能需要使用昂贵的商业实时数字模拟器（RTDS），从而降低了这些技术的优势。本文的重点是提出一种转换器的降阶模型，以便能够使用所需实时数字模拟器的低资源对直流分布式系统进行PHIL分析。与更复杂的变换器模型相比，本文验证了所提出的降阶模型能够确定直流分布式系统的稳定性。此外，在商业RTDS平台中执行关于实现中所需资源的两个模型之间的比较，以验证所提出的模型在执行大型配电系统的PHIL分析中的益处。 et.al.|[2401.18067](http://arxiv.org/abs/2401.18067)|null|\n", "2401.18050": "|**2024-01-31**|**Hypermultiplexed Integrated Tensor Optical Processor**|光学处理器具有高时钟速率和低数据传输损耗，在加速深度学习任务方面具有巨大潜力。然而，由于设备数量的二次缩放、高速模数转换器的能量成本以及缺乏在线非线性，现有的集成系统受到低可扩展性的阻碍。在这里，我们用波长-空间-时间复用光学张量处理器克服了这些挑战。超维并行允许使用$O（N）$设备进行矩阵乘法运算（$N^｛3｝$运算）。我们结合了用于输入激活的波长复用III/V基微米级激光器（跨度~1 THz）、在线整流器（ReLU）非线性和用于动态加权的薄膜铌酸锂电光调制器（$V_｛\\pi｝\\approxx1.3 V$）。每个设备每秒编码100亿次激活，我们展示了一个具有405000个参数的机器学习模型。具有实时可编程性的高时钟速率（10 GS/s）、低能耗（500 fJ/OP）并行计算为下一代可扩展人工智能加速器释放了光的全部潜力。 et.al.|[2401.18050](http://arxiv.org/abs/2401.18050)|null|\n", "2401.18046": "|**2024-01-31**|**Multipath parsing in the brain**|人类按照听到的顺序逐字逐句地理解句子。这种增量需要解决句法关系的暂时歧义。我们通过将增量生成依赖性解析器的预测与听有声读物时进行功能神经成像的人的时间历程数据相关联，研究了人类如何处理这些句法歧义。特别是，我们比较了关于逐字理解过程中发展中的句法分析数量的相互竞争的假设：一个与多个。这种比较包括根据现有的fMRI数据集，使用LLM自适应编码，从最先进的依赖性解析器中评估语法惊喜。在英文和中文的数据中，我们都发现了多路径解析的证据。与这种多路径效应相关的大脑区域包括双侧颞上回。 et.al.|[2401.18046](http://arxiv.org/abs/2401.18046)|null|\n", "2401.18035": "|**2024-01-31**|**Optimizing contrastive learning for cortical folding pattern detection**|人类大脑皮层有许多突起和凹槽，称为脑回和脑沟。尽管主要皮层褶皱具有很高的个体间一致性，但当我们检查折叠模式的确切形状和细节时，情况并非如此。由于这种复杂性，表征皮层折叠的可变性并将其与受试者的行为特征或病理联系起来仍然是一个悬而未决的科学问题。经典的方法包括根据几何距离手动或半自动标记一些特定的模式，但最近数万名受试者的MRI图像数据集的可用性使现代深度学习技术特别有吸引力。在这里，我们建立了一个自监督的深度学习模型来检测扣带区域的折叠模式。我们在人类连接体项目（1101名受试者）和英国生物银行（21070名受试人）数据集上训练了一个对比自监督模型（SimCLR），该模型在皮层骨架上进行了基于拓扑的增强，皮层骨架是捕捉褶皱形状的拓扑对象。我们探索了SimCLR的几种骨干架构（卷积网络、DenseNet和PointNet）。为了评估和测试，我们在一个数据库上执行线性分类任务，该数据库手动标记扣带区域是否存在“双平行”折叠模式，这与精神分裂症特征有关。给出0.76的测试AUC的最佳模型是具有6层、10维潜在空间、线性投影头并使用分支剪切增强的卷积网络。这是首次将自监督深度学习模型应用于如此大的数据集上的皮层骨骼并进行定量评估。我们现在可以设想下一步：将其应用于其他大脑区域，以检测其他生物标志物。 et.al.|[2401.18035](http://arxiv.org/abs/2401.18035)|null|\n", "2401.18034": "|**2024-01-31**|**Paramanu: A Family of Novel Efficient Indic Generative Foundation Language Models**|我们介绍了Gyan AI Paramanu（“原子”），一个新的印度语言模型家族。它是自回归单语、双语、，以及在单个GPU上从头开始为10种印度语言（阿萨姆语、孟加拉语、印地语、康卡尼语、迈提语、马拉地语、奥里亚语、梵语、泰米尔语、泰卢固语）在13.29M到367.5M不等的5个脚本（孟加拉语、梵文、奥迪亚语、泰米尔语、泰卢固语）预训练的多语言印度语模型。模型在单个GPU中使用1024的上下文大小进行预训练。这些型号非常高效、小巧、快速、功能强大。我们还开发了一种高效、最先进的印度语标记器，甚至可以标记看不见的语言。为了避免我们的多语言mParamanu模型中的“多语言诅咒”，我们使用相同的脚本通过类型学分组对可比语料库进行了预训练。我们对我们的开放端文本生成预训练模型进行了人工评估，评估了孟加拉语、印地语和梵语的语法、连贯性、创造力和真实性指标。我们的孟加拉语、印地语和梵语模型在很大程度上优于GPT-3.5-Turbo（ChatGPT）、Bloom 7B、LLaMa-2 7B、OPT 6.7B、GPT-J 6B、GPTNeo 1.3B、GPT2-XL大型语言模型（LLM），尽管与标准7B LLM相比，其尺寸小了66到20倍。要在我们预训练的模型上运行推理，CPU就足够了，而不需要GPU。我们还对预先训练的孟加拉语、印地语、马拉地语、泰米尔语和泰卢固语模型进行了相应语言的23k指令调整。我们的预训练和指令调整模型是有史以来为印度语开发的最强大、最高效的小型生成语言模型中的第一个，各种结果表明，在没有大量计算能力和大量参数的情况下，高质量的生成语言模型是可能的。我们计划在发布我们的模型https://www.bharatgpts.com. et.al.|[2401.18034](http://arxiv.org/abs/2401.18034)|null|\n", "2401.18032": "|**2024-01-31**|**DROP: Decouple Re-Identification and Human Parsing with Task-specific Features for Occluded Person Re-identification**|本文介绍了一种用于被遮挡人再识别的解耦再识别和人解析（DROP）方法。与使用全局特征同时进行ReID和人工解析的多任务学习或依赖语义信息进行注意力引导的主流方法不同，DROP认为前者的较差性能是由于ReID和人类解析特征的粒度要求不同。ReID关注行人部分之间的实例部分级别差异，而人类解析则以语义空间上下文为中心，反映人体的内部结构。为了解决这一问题，DROP将ReID和人工解析的特征解耦，提出了保留细节的上采样，以组合不同分辨率的特征图。用于人工解析的解析特定特征是解耦的，并且人工位置信息专门添加到人工解析分支中。在ReID分支中，引入了一个部件感知的紧凑性损失来增强实例级部件差异。实验结果突出了DROP的有效性，尤其是在Occluded Duke上获得了76.8%的Rank-1准确率，超过了两种主流方法。代码库可在访问https://github.com/shuguang-52/DROP. et.al.|[2401.18032](http://arxiv.org/abs/2401.18032)|**[link](https://github.com/shuguang-52/drop)**|\n", "2401.18024": "|**2024-01-31**|**Benchmarking Private Population Data Release Mechanisms: Synthetic Data vs. TopDown**|差异隐私（DP）越来越多地用于保护分级、表格化的人口数据（如人口普查数据）的发布。在这种设置中实现DP的一种常见方法是释放对预定义查询集的噪声响应。例如，这是美国人口普查局使用的TopDown算法的方法。这样的方法有一个重要的缺点：它们无法回答未优化的查询。一个有吸引力的替代方案是生成DP合成数据，该数据是从一些生成分布中提取的。与TopDown方法一样，合成数据也可以进行优化以回答特定查询，同时还允许数据用户稍后提交对合成人口数据的任意查询。据我们所知，还没有对这些方法进行正面的实证比较。这项研究在TopDown算法和私人合成数据生成之间进行了这样的比较，以确定查询复杂性、分布内与分布外查询以及隐私保证对准确性的影响。我们的结果表明，对于分布式查询，TopDown算法比我们评估的任何合成数据方法都能实现更好的隐私保真度权衡；例如，在我们的实验中，在相同的隐私预算下，TopDown在计数查询时的错误比领先的合成数据方法至少低20倍。我们的研究结果为从业者和合成数据研究界提供了指导方针。 et.al.|[2401.18024](http://arxiv.org/abs/2401.18024)|null|\n", "2401.18018": "|**2024-01-31**|**Prompt-Driven LLM Safeguarding via Directed Representation Optimization**|使用安全提示准备模型输入是保护大型语言模型（LLM）不遵守包含有害意图的查询的常见做法。然而，安全提示的工作机制尚未完全了解，这阻碍了自动优化它们以提高LLM安全性的潜力。受此问题的启发，我们从模型表示的角度研究了安全提示的影响。我们发现，在模型的表示空间中，可以在很大程度上区分有害和无害的查询，但安全提示并没有显著增强这一点。相反，查询的表示被不同的安全提示向相似的方向移动，即使查询是无害的，模型也更容易被拒绝（即拒绝提供帮助）。受这些发现的启发，我们提出了一种称为DRO（定向表示优化）的自动安全提示优化方法。DRO将安全提示视为连续的、可训练的嵌入，并学会将有害/无害查询的表示沿着/相反于模型拒绝概率增加的方向移动。我们证明，在不影响通用模型能力的情况下，DRO显著提高了人工制作的安全提示的保护性能，并优于在域外基准上评估的强基线。 et.al.|[2401.18018](http://arxiv.org/abs/2401.18018)|null|\n", "2401.18013": "|**2024-01-31**|**On The Power of Subtle Expressive Cues in the Perception of Human Affects**|在这项研究中，我们介绍了一种基于草图的方法，用于测试微妙的表达线索如何影响人物插图中的情感感知。我们专门研究了通过鼻子方向隐含指定的人类姿势和凝视方向对感知情绪和情绪的影响。通过一系列使用跑步人物粗略插图的用户研究，专业插画师通过调整鼻子方向来操纵视线方向，我们发现这种简单的变化会产生各种各样的感知影响，从恐惧到担忧和好奇。这些发现阐明了精细细节在上下文感知系统设计中定义上下文的重要性，并强调了识别和表达情感的重要性。理解细微的表达线索对于开发能够表达情感的情感智能系统至关重要。 et.al.|[2401.18013](http://arxiv.org/abs/2401.18013)|null|\n", "2401.17996": "|**2024-01-31**|**Development and Adaptation of Robotic Vision in the Real-World: the Challenge of Door Detection**|移动服务机器人在以人为中心的现实世界领域越来越普遍，在不受约束的室内环境中自主运行。在这样的背景下，机器人视觉在使服务机器人能够从视觉观察中感知高级环境特征方面发挥着核心作用。尽管基于深度学习的数据驱动方法突破了视觉系统的界限，但将这些技术应用于现实世界的机器人场景会带来独特的方法挑战。传统的模型无法代表服务机器人典型的具有挑战性的感知约束，必须适应机器人最终运行的特定环境。我们提出了一种利用真实感模拟的方法，该方法平衡了数据质量和获取成本，用于从机器人的角度合成视觉数据集，用于训练深度架构。然后，我们展示了将通用检测器用于机器人部署的目标域的好处，还展示了从这种设置中获得新示例的努力与性能增益之间的权衡。在我们广泛的实验活动中，我们专注于门检测任务（即识别门口的存在和可通行性），在动态设置中，这有助于推断地图的拓扑结构。我们的发现在现实世界的机器人部署中得到了验证，比较了著名的深度学习模型，并证明了我们的方法在实际环境中的有效性。 et.al.|[2401.17996](http://arxiv.org/abs/2401.17996)|null|\n", "2401.17979": "|**2024-01-31**|**Entity Linking in the Job Market Domain**|在自然语言处理中，实体链接（EL）一直以维基百科为中心，但在就业市场领域仍有待开发。消除技能提及的歧义可以帮助我们深入了解当前劳动力市场的需求。在这项工作中，我们率先探索了该领域的EL，特别是针对职业技能与ESCO分类法的联系（le Vrang et al.，2014）。先前的努力将粗粒度（完整）句子与相应的ESCO技能联系起来。在这项工作中，我们将更细粒度的跨度级别的技能提及联系起来。我们在综合生成的提及-技能对数据集上调整了两个高性能神经EL模型，一个是双编码器（Wu et al.，2020），另一个是自回归模型（Cao et al.，2021），并在人类注释的技能链接基准上对其进行评估。我们的研究结果表明，这两个模型都能够将技能的隐含提及与其正确的分类学对应物联系起来。根据经验，BLINK在严格评估中优于GENRE，但GENRE在松散评估中表现更好（准确度@$k$）。 et.al.|[2401.17979](http://arxiv.org/abs/2401.17979)|**[link](https://github.com/mainlp/el_esco)**|\n", "2401.17974": "|**2024-01-31**|**GUMsley: Evaluating Entity Salience in Summarization for 12 English Genres**|随着NLP模型越来越能够从连贯实体而非字符串的角度理解文档，为每个文档获取最显著的实体不仅是一项重要的最终任务，而且对信息检索（IR）和其他下游应用（如可控摘要）也至关重要。在本文中，我们提出并评估了GUMsley，这是第一个实体显著性数据集，涵盖了12种类型的英语文本的所有命名和非命名显著实体，与实体类型、维基链接和完整的共指解析注释相一致。我们提倡使用人类摘要对显著性进行严格定义，并根据摘要中是否提到源实体，证明注释者之间对显著性的高度一致性。我们的评估显示，预先训练的SOTA摘要模型和零样本LLM提示在捕获生成摘要中的显著实体方面表现不佳。我们还表明，通过缓解现有抽象摘要中的实体幻觉问题，预测或向几个模型架构提供显著实体可以提高性能，并有助于获得更高质量的摘要。 et.al.|[2401.17974](http://arxiv.org/abs/2401.17974)|null|\n", "2401.17959": "|**2024-01-31**|**University Students Motives and Challenges in Utilising Institutional Repository Resources**|学术机构的核心职能之一是产生知识，将其传播给预期受众，并保存起来供未来使用。学术机构现在正在建立机构知识库（IRs），以收集制作的资源，促进机构内制作的知识材料的获取、传播、利用和管理。本研究旨在评估达累斯萨拉姆大学研究生利用IR资源的动机以及他们在利用IR资源时遇到的挑战。本研究采用描述性研究设计，同时采用定性和定量研究方法。这项研究的人群包括达累斯萨拉姆大学的研究生、图书馆员和信息通信技术人员。本研究方便且有针对性地抽取了102名受访者的样本。数据是通过问卷调查、访谈以及对文献来源的审查收集的。定量数据通过社会科学第16版统计软件包进行分析，定性数据使用内容分析进行分析。研究结果表明，对全文文档的访问、IR资源的相关性以及在存储库系统中容易搜索材料都会激励IR资源的利用。然而，阻碍这些资源利用的几个挑战，包括不可靠的互联网接入、无法访问全文和缺乏指导政策，已被揭示为IR资源利用的主要挑战。这项研究建议对研究生进行一般使用IRs的培训。此外，大学管理层应制定IR政策，指导IR资源的利用 et.al.|[2401.17959](http://arxiv.org/abs/2401.17959)|null|\n", "2401.17942": "|**2024-01-31**|**Impact of Lunar Dust on Free Space Optical (FSO) Energy Harvesting**|在太空探索野心不断升级的背景下，特别是像阿尔忒弥斯这样旨在实现人类在月球上可持续存在的项目，高效可靠的能源传输问题已成为一个关键问题。本文重点研究了月球表面上方悬浮的月球尘埃颗粒对通过自由空间光学（FSO）光束（通常称为“激光功率束”）收集能量的影响。这项研究采用了已知的数学模型和数值分析，利用文献中的真实数据来检查月球表面的地对地连接。更准确地说，它评估了在光照和暗照条件下，在月球尘埃存在的情况下，FSO能量收集的传输损耗和性能。研究结果表明，关于月球表面以上高度和传输距离的选择是评估损失和能量收集效率的关键决定因素。具体而言，据观察，在20公里的距离上操作250W的北极星漫游车所需的发射功率约为几千瓦。此外，有人指出，在月球较暗的区域，月球尘埃对传输的影响几乎可以忽略不计，这使得这些区域更有利于基于FSO的能量传输。 et.al.|[2401.17942](http://arxiv.org/abs/2401.17942)|null|\n", "2401.17941": "|**2024-01-31**|**Investigation of Microstructure and Corrosion Resistance of Ti-Al-V Titanium Alloys Obtained by Spark Plasma Sintering**|介绍了用火花等离子烧结（SPS）获得的Ti和Ti-Al-V俄罗斯工业钛合金的微观结构和耐腐蚀性能的研究结果。对Ti-Al-V钛合金试样的微观组织、相组成、硬度、抗拉强度、电化学腐蚀性能和热盐腐蚀性能进行了研究。结果表明，合金试样具有均匀、高密度的微观组织和高硬度值。所研究的合金在酸性水溶液中测试时也具有高的电化学腐蚀耐受性，导致晶间腐蚀以及高的热盐腐蚀耐受性。提出了这样一种假设，即合金的高硬度以及试样中央和横向部分的耐腐蚀性差异是由于碳从石墨模具扩散到试样表面。 et.al.|[2401.17941](http://arxiv.org/abs/2401.17941)|null|\n", "2401.17914": "|**2024-01-31**|**Attention Graph for Multi-Robot Social Navigation with Deep Reinforcement Learning**|在行人中学习机器人导航策略对于基于领域的应用至关重要。将感知、规划和预测相结合，使我们能够对机器人和行人之间的互动进行建模，从而产生令人印象深刻的结果，尤其是最近基于深度强化学习（RL）的方法。然而，这些工作没有考虑多机器人场景。在本文中，我们提出了MultiSoc，这是一种使用RL学习多智能体社会感知导航策略的新方法。受最近关于多智能体深度RL的工作的启发，我们的方法利用基于图的智能体交互表示，结合实体（行人和智能体）的位置和视野。每个智能体使用一个基于两个图神经网络的模型，并结合注意力机制。首先，边缘选择器生成稀疏图，然后群组协调器应用节点注意力来生成表示每个实体对其他实体的影响的图。这被纳入到一个无模型的RL框架中，以学习多智能体策略。我们在模拟上评估了我们的方法，并在一组不同的条件下（代理人/行人的数量）提供了一系列实验。经验结果表明，我们的方法比社交导航深度RL单智能体技术学习更快，并在具有多个异构人类的挑战性人群导航中实现了高效的多智能体隐式协调。此外，通过结合可定制的元参数，我们可以调整邻域密度，以在我们的导航策略中加以考虑。 et.al.|[2401.17914](http://arxiv.org/abs/2401.17914)|null|\n", "2401.17911": "|**2024-01-31**|**SNNLP: Energy-Efficient Natural Language Processing Using Spiking Neural Networks**|随着尖峰神经网络受到越来越多的关注，我们期待着这种计算范式在计算机视觉和信号处理以外的领域的应用。在神经形态环境中，一个未被充分探索的主要领域是自然语言处理（NLP），其中大多数最先进的解决方案仍然严重依赖于消耗资源和耗电的传统深度学习架构。因此，为神经形态结构设计NLP模型是令人信服的，因为它们的能量需求较低，还有一个更像人脑的操作模型来处理信息的额外好处。然而，将NLP引入神经形态设置的最大问题之一是将文本正确编码为尖峰序列，以便当前和未来的SNN架构都能无缝处理。在本文中，我们比较了将文本编码为尖峰的各种方法，并评估了每种方法在下游NLP任务（即情绪分析）的相关SNN中的性能。此外，我们还提出了一种将文本编码为尖峰的新方法，该方法在我们的基准NLP任务中比广泛使用的速率编码技术泊松率编码高出约13%。随后，我们展示了与传统的深度神经网络相比，在情感分析任务的硬件中实现的SNN的能量效率，观察到在推理过程中能量效率增加了32倍以上，在训练过程中能量效益增加了60倍以上，同时产生了预期的能量性能折衷。 et.al.|[2401.17911](http://arxiv.org/abs/2401.17911)|null|\n", "2401.17883": "|**2024-01-31**|**Reimagining Reality: A Comprehensive Survey of Video Inpainting Techniques**|本文全面分析了视频修复技术的最新进展，视频修复技术是计算机视觉和人工智能的关键子集。作为一种用看似合理的内容恢复或填充视频序列中缺失或损坏部分的过程，随着深度学习方法的出现，视频修复已经发生了重大变化。尽管现有的方法过多且发展迅速，但情况仍然复杂，对新手和知名研究人员都构成了挑战。我们的研究解构了主要技术、它们的基础理论及其有效应用。此外，我们围绕两个经常被忽视的维度进行了详尽的比较研究：视觉质量和计算效率。我们采用以人为中心的方法来评估视觉质量，招募了一组注释人员来评估不同视频修复技术的输出。这提供了一种细致入微的定性理解，补充了传统的定量指标。同时，我们深入研究了计算方面，比较了标准化硬件设置中的推理时间和内存需求。这一分析强调了质量和效率之间的平衡：这是资源可能受到限制的实际应用程序的关键考虑因素。通过将人类验证和计算资源比较相结合，这项调查不仅阐明了视频修复技术的现状，还为未来在这个充满活力和不断发展的领域的探索指明了方向。 et.al.|[2401.17883](http://arxiv.org/abs/2401.17883)|null|\n", "2401.17882": "|**2024-01-31**|**I Think, Therefore I am: Awareness in Large Language Models**|大型语言模型（LLM）是否表现出与人类相似的意识形式？在本文中，我们将意识的概念引入LLM，认为意识是LLM增强与人类互动的可信度的一个重要方面，同时确保伦理反应。我们将LLM中的意识定义为将自己感知和理解为人工智能模型并展示社会智能的能力。我们确定了意识的四个关键维度：能力、使命、情感和视角。为了在这些维度上评估LLM，我们引入了一个专门的数据集AwareLLM数据集。我们的研究结果表明，LLM表现出了相当程度的意识，尽管它们仍然缺乏实质性的能力意识。 et.al.|[2401.17882](http://arxiv.org/abs/2401.17882)|null|\n", "2401.17874": "|**2024-01-31**|**VR-based generation of photorealistic synthetic data for training hand-object tracking models**|用于在3D中精确跟踪手-物体交互（HOI）的监督学习模型需要大量的注释数据来进行训练。此外，非专家在2D图像上标记3D地面实况（例如，6DoF物体姿态）是不直观的。为了解决这些问题，我们提出了“blender hoisonth”，一个基于blender软件的交互式合成数据生成器。Blender hoisonth可以按比例生成并自动注释视觉HOI训练数据。其他竞争方法通常在没有人工输入的情况下完全生成合成HOI数据。虽然这在某些情况下可能是有益的，但HOI应用固有地需要对HOI进行直接控制，作为人类意图的表达。使用blender hoisonth，用户可以使用标准虚拟现实硬件通过虚拟手与物体进行交互。合成生成的数据具有高度的真实感，并包含手抓握物体并在3D中移动物体的视觉上合理和物理上真实的视频。为了证明我们数据生成的有效性，我们将著名的DexYCB数据集中的大部分训练数据替换为hoisonth数据，并用它训练最先进的HOI重建模型。我们表明，尽管进行了数据替换，但模型性能没有显著下降。 et.al.|[2401.17874](http://arxiv.org/abs/2401.17874)|null|\n", "2401.17866": "|**2024-01-31**|**Making Sense of Knowledge Intensive Processes: an Oil & Gas Industry Scenario**|感官制造是一个持续不断的过程，人们通过这个过程将意义与体验联系起来。它可以是一个被称为绑架的个体过程，也可以是人们赋予集体体验意义的群体过程。一个群体的感知受到每个人对体验的诱拐过程的影响。每个协作过程都需要一定程度的感知才能显示结果。对于一个知识密集型的过程来说，感知是其核心，并与大多数任务相关。我们展示了在石油和天然气行业知识密集型过程中进行的实地调查的结果。我们的研究结果表明，不同类型的知识可以组合成感知过程的结果（例如决策、需要更多讨论等）。本文提出了一组初始的知识类型，这些知识类型可以组合成协作决策过程的感知结果。我们还讨论了使用人工智能驱动的系统来支持感知过程的想法。 et.al.|[2401.17866](http://arxiv.org/abs/2401.17866)|null|\n", "2401.17858": "|**2024-01-31**|**Probing Language Models' Gesture Understanding for Enhanced Human-AI Interaction**|大型语言模型（LLM）的兴起已经影响到了超越文本生成的各个学科。超越文本性质，本项目提案旨在研究LLM与非语言交流之间的互动，特别是手势。该提案提出了一项计划，以检查LLM在解读文本提示中的显性和隐性非语言线索方面的熟练程度，以及它们将这些手势与各种上下文因素联系起来的能力。该研究建议测试已建立的心理语言学研究设计，以构建一个全面的数据集，将文本提示与详细的手势描述配对，包括不同的区域变化和语义标签。为了评估LLM对手势的理解，计划进行实验，评估其模拟人类行为的能力，以复制心理语言学实验。这些实验考虑了文化维度，并测量LLM识别的手势与数据集之间的一致性，揭示了模型对非语言线索（如手势）的上下文解释。 et.al.|[2401.17858](http://arxiv.org/abs/2401.17858)|null|\n", "2401.17851": "|**2024-01-31**|**Instruction-Guided Scene Text Recognition**|最近，多模式模型在视觉任务中表现出了吸引人的性能，因为指导训练唤起了理解细粒度视觉内容的能力。然而，由于自然图像和文本图像之间的差距，目前的方法不能简单地应用于场景文本识别。在本文中，我们引入了一种新的范式，将STR定义为一个指令学习问题，并提出了指令引导的场景文本识别（IGTR）来实现有效的跨模态学习。IGTR首先生成丰富多样的<condition，question，answer>指令三元组，为细致入微的文本图像理解提供指导。然后，我们设计了一种具有专用跨模态特征融合模块和多任务答题头的架构，以有效地融合答题所需的指令和图像特征。基于这些设计，IGTR通过理解字符属性来促进准确的文本识别。在英文和中文基准上的实验表明，IGTR显著优于现有模型。此外，通过调整指令，IGTR能够实现各种识别方案。其中包括零样本预测，其中模型是基于没有明确针对字符识别的指令进行训练的，以及很少出现和形态相似的字符的识别，这是现有模型以前的挑战。 et.al.|[2401.17851](http://arxiv.org/abs/2401.17851)|null|\n", "2401.17837": "|**2024-01-31**|**Safe Reinforcement Learning-Based Eco-Driving Control for Mixed Traffic Flows With Disturbances**|本文提出了一种针对混合交通流的基于安全学习的生态驾驶框架，旨在优化能源效率，同时保证实际系统运行中的安全。尽管强化学习（RL）能够在复杂的环境中优化能量效率，但在训练过程中它受到安全要求的挑战。在实际应用程序中部署经过培训的策略时，另一个问题是缺乏安全保障。与RL相比，模型预测控制（MPC）可以处理受约束的动力学系统，确保安全驾驶。然而，主要的挑战在于复杂的生态驾驶任务和干扰的存在，这分别挑战了MPC的设计和约束的满足。为了解决这些限制，所提出的框架结合了基于管道的增强型MPC（RMPC），以确保RL策略在扰动下的安全执行，从而提高控制鲁棒性。RL不仅优化了混合交通中联网和自动化车辆的能源效率，而且还处理了更多不确定的场景，其中在优化框架中考虑了人类驾驶车辆的能源消耗及其多样化和随机的驾驶行为。仿真结果表明，与RMPC技术相比，该算法的整体能效平均提高了10.88%，而与RL算法相比，它有效地防止了车车间碰撞。 et.al.|[2401.17837](http://arxiv.org/abs/2401.17837)|null|\n", "2401.17829": "|**2024-01-31**|**Evolving privacy: drift parameter estimation for discretely observed i.i.d. diffusion processes under LDP**|研究了离散观测的独立同分布随机微分方程漂移系数的估计问题。这是在考虑额外约束的情况下完成的，其中只有公共数据可以发布并用于推理。针对一类随机微分方程组，正式引入了局部微分私密性的概念。目标是通过提出基于伪似然方法的对比度函数来估计漂移参数。适当缩放的拉普拉斯噪声被合并以满足隐私要求。我们的主要发现包括与隐私级别相关的明确条件的推导。在这些条件下，我们建立了相关估计量的一致性和渐近正态性。值得注意的是，收敛率与隐私水平密切相关，在某些情况下可能与忽略隐私约束的情况完全不同。当离散化步骤接近零并且过程数$N$趋于无穷大时，我们的结果成立。 et.al.|[2401.17829](http://arxiv.org/abs/2401.17829)|null|\n", "2401.17827": "|**2024-01-31**|**Neural Machine Translation for Malayalam Paraphrase Generation**|本研究探讨了四种在马拉雅拉姆语中产生转述的方法，利用可用于英语转述的资源和预先训练的神经机器翻译（NMT）模型。我们使用自动度量（如BLEU、METEOR和余弦相似性）以及人工注释来评估结果转述。我们的研究结果表明，自动化评估措施可能不完全适用于马拉雅拉姆语，因为它们与人类的判断不一致。这种差异强调了更细致的转述评估方法的必要性，尤其是对于高度粘合的语言。 et.al.|[2401.17827](http://arxiv.org/abs/2401.17827)|null|\n", "2401.17821": "|**2024-01-31**|**Do Object Detection Localization Errors Affect Human Performance and Trust?**|边界框通常用于将自动对象检测结果传达给人类，帮助人类完成大量任务。我们研究了边界框定位误差与人工任务性能之间的关系。我们在视觉多对象计数任务中使用观察者性能研究来测量不同边界框精度水平下的人类信任和性能。结果表明，定位误差对人类对系统的准确性或信任度没有显著影响。回忆和精度误差会影响人类的表现和信任，这表明基于F1分数的优化算法在人机任务中更有益。最后，本文对具有中心点的多目标计数任务中的边界框进行了改进，显示出改进的性能和更好的定位不精确性。 et.al.|[2401.17821](http://arxiv.org/abs/2401.17821)|null|\n"}}