{"3D": {"2309.02318": "|**2023-09-05**|**TiAVox: Time-aware Attenuation Voxels for Sparse-view 4D DSA Reconstruction**|四维数字减影血管造影（4D DSA）在许多医学疾病的诊断中起着至关重要的作用，如动静脉畸形（AVM）和动静脉瘘（AVF）。尽管4D DSA的重建具有重要的应用价值，但它需要大量的视图来有效地模拟复杂的血管和放射造影流，从而意味着显著的辐射剂量。为了解决这一高辐射问题，我们提出了一种用于稀疏视图4D DSA重建的时间感知衰减体素（TiAVox）方法，为高质量的4D成像铺平了道路。此外，可以从重建的4D DSA图像生成2D和3D DSA成像结果。TiAVox引入了4D衰减体素网格，从空间和时间维度反映衰减特性。它通过最小化渲染图像和稀疏2D DSA图像之间的差异来进行优化。在没有任何神经网络参与的情况下，TiAVox享有特定的物理可解释性。每个可学习体素的参数表示衰减系数。我们在临床和模拟数据集上验证了TiAVox方法，在临床来源的数据集上仅使用30个视图，就实现了31.23的新视图合成峰值信噪比（PSNR），而传统的Feldkamp-Davis-Kress方法需要133个视图。类似地，在合成数据集中只有10个视图的情况下，TiAVox对于新视图合成产生了34.32的PSNR，对于3D重建产生了41.40的PSNR。我们还进行了消融研究，以证实TiAVox的主要成分。该代码将公开提供。 et.al.|[2309.02318](http://arxiv.org/abs/2309.02318)|null|\n", "2309.01811": "|**2023-09-04**|**Instant Continual Learning of Neural Radiance Fields**|神经辐射场（NeRFs）已成为一种有效的视图合成和三维场景重建方法。然而，传统的训练方法需要在场景优化期间访问所有训练视图。在连续学习场景中，这种假设可能是禁止的，在这种场景中，以顺序的方式获取新数据，并且需要NeRF的连续更新，如在汽车或遥感应用中。当在这样一个持续的环境中天真地训练时，传统的场景表示框架会遭受灾难性的遗忘，在对新数据进行训练后，先前学习的知识会被破坏。先前使用NeRF缓解遗忘的工作存在重建质量低和延迟高的问题，这使得它们在现实世界中的应用不切实际。我们提出了一个用于训练NeRF的持续学习框架，该框架利用了基于回放的方法与显-隐混合场景表示相结合。当在连续环境中训练时，我们的方法在重建质量方面优于以前的方法，同时具有更快一个数量级的额外好处。 et.al.|[2309.01811](http://arxiv.org/abs/2309.01811)|null|\n", "2309.01296": "|**2023-09-04**|**EMR-MSF: Self-Supervised Recurrent Monocular Scene Flow Exploiting Ego-Motion Rigidity**|自监督单目场景流估计旨在从两个时间连续的单目图像中理解3D结构和3D运动，由于其简单经济的传感器设置而受到越来越多的关注。然而，当前方法的准确性受到网络架构效率较低和缺乏正则化运动刚度的瓶颈的影响。在本文中，我们借鉴了监督学习范围下网络架构设计的优势，提出了一个名为EMR-MSF的高级模型。我们通过精心构建的自我运动聚合模块进一步施加了显式和鲁棒的几何约束，其中提出了刚性软掩模来过滤动态区域，以便使用静态区域进行稳定的自我运动估计。此外，我们提出了运动一致性损失和掩码正则化损失，以充分利用静态区域。集成了几种有效的训练策略，包括梯度分离技术和增强的视图合成过程，以获得更好的表现。我们提出的方法在很大程度上优于以前的自监督工作，并赶上了监督方法的性能。在KITTI场景流基准上，我们的方法将最先进的自监督单目方法的SF all指标提高了44%，并在包括深度和视觉里程计在内的子任务以及其他自监督单任务或多任务方法中表现出优异的性能。 et.al.|[2309.01296](http://arxiv.org/abs/2309.01296)|null|\n", "2309.01104": "|**2023-09-03**|**Turn Fake into Real: Adversarial Head Turn Attacks Against Deepfake Detection**|恶意使用deepfakes会引起公众的严重关注，并降低人们对数字媒体的信任。尽管已经提出了有效的深度伪造检测器，但它们在很大程度上容易受到对抗性攻击。为了评估检测器的鲁棒性，最近的研究探索了各种攻击。然而，所有现有的攻击都局限于2D图像扰动，很难转化为现实世界中的面部变化。在本文中，我们提出了对抗性头转向（AdvHeat），这是针对深度伪造检测器的3D对抗性人脸视图的首次尝试，基于从单视图伪造图像中合成人脸视图。大量实验验证了各种探测器在现实的黑盒场景中对AdvHeat的脆弱性。例如，基于简单随机搜索的AdvHeat在360个搜索步骤中获得了96.8%的高攻击成功率。当允许额外的查询访问时，我们可以进一步将步骤预算减少到50。额外的分析表明，AdvHeat在交叉检测器的可转移性和对防御的鲁棒性方面都优于传统攻击。AdvHeat生成的对抗性图像也显示出自然的外观。我们的代码，包括为FaceForensics++的1000个ID中的每个ID生成由360个合成视图组成的多视图数据集的代码，可在https://github.com/twowwj/AdvHeaT. et.al.|[2309.01104](http://arxiv.org/abs/2309.01104)|null|\n", "2308.15049": "|**2023-08-29**|**Pose-Free Neural Radiance Fields via Implicit Pose Regularization**|无姿态神经辐射场（NeRF）旨在用未经处理的多视图图像训练NeRF，近年来取得了令人印象深刻的成功。大多数现有工作共享一个管道，首先用渲染图像训练粗略的姿态估计器，然后联合优化估计的姿态和神经辐射场。然而，由于姿态估计器仅用渲染图像进行训练，由于真实图像和渲染图像之间的域间隙，姿态估计通常对真实图像有偏差或不准确，导致真实图像的姿态估计鲁棒性差，并且在联合优化中存在进一步的局部最小值。我们设计了IR NeRF，这是一种创新的无姿态NeRF，它引入了隐式姿态正则化来改进未聚焦真实图像的姿态估计器，并提高了真实图像姿态估计的鲁棒性。通过特定场景的2D图像的集合，IR NeRF构建了一个场景码本，该场景码本存储场景特征，并隐式地捕捉特定场景的姿势分布作为先验。因此，根据只有当2D真实图像的估计姿势位于姿势分布内时才可以从场景码本很好地重建2D真实图像这一原理，可以利用场景先验来提高姿势估计的鲁棒性。大量实验表明，IR NeRF实现了卓越的新视图合成，并在多个合成和真实数据集上始终优于最先进的视图合成。 et.al.|[2308.15049](http://arxiv.org/abs/2308.15049)|null|\n", "2308.14816": "|**2023-08-28**|**CLNeRF: Continual Learning Meets NeRF**|新颖的视图合成旨在呈现给定一组校准图像的看不见的视图。在实际应用中，场景的覆盖范围、外观或几何结构可能会随着时间的推移而变化，不断捕捉新的图像。有效地整合这种持续的变化是一个公开的挑战。标准NeRF基准测试仅涉及场景覆盖范围的扩展。为了研究其他实际的场景变化，我们提出了一个新的数据集，即跨时间世界（WAT），由外观和几何结构随时间变化的场景组成。我们还提出了一种简单而有效的方法CLNeRF，它将连续学习（CL）引入到神经辐射场（NeRF）中。CLNeRF结合了生成回放和即时神经图形原件（NGP）架构，以有效防止灾难性遗忘，并在新数据到达时有效更新模型。我们还向NGP添加了可训练的外观和几何嵌入，允许单个紧凑模型处理复杂的场景变化。在不需要存储历史图像的情况下，在变化场景的多次扫描上顺序训练的CLNeRF与在一次所有扫描上训练的上界模型性能相当。与其他CL基线相比，CLNeRF在标准基准和WAT上的表现要好得多。源代码和WAT数据集可在https://github.com/IntelLabs/CLNeRF.视频演示可在以下网址获得：https://youtu.be/nLRt6OoDGq0?si=8yD6k-8MMBJInQP et.al.|[2308.14816](http://arxiv.org/abs/2308.14816)|**[link](https://github.com/intellabs/clnerf)**|\n", "2308.14737": "|**2023-08-28**|**Flexible Techniques for Differentiable Rendering with 3D Gaussians**|快速、可靠的形状重建是许多计算机视觉应用中的重要组成部分。Neural Radiance Fields证明，真实感的新视图合成是触手可及的，但受到真实场景和对象快速重建性能要求的限制。最近的一些方法建立在替代形状表示的基础上，特别是3D高斯。我们开发了这些渲染器的扩展，例如集成可微分光流、导出防水网格和渲染每光线法线。此外，我们还展示了最近的两种方法是如何相互操作的。这些重建快速、稳健，并且可以在GPU或CPU上轻松执行。有关代码和可视化示例，请参见https://leonidk.github.io/fmb-plus et.al.|[2308.14737](http://arxiv.org/abs/2308.14737)|null|\n", "2308.14108": "|**2023-08-27**|**Depth self-supervision for single image novel view synthesis**|在本文中，我们解决了在给定单个帧作为输入的情况下从任意视点生成新图像的问题。虽然在这种设置中操作的现有方法旨在预测目标视图深度图以指导合成，但在没有明确监督此类任务的情况下，我们共同优化了新视图合成和深度估计的框架，以最大限度地释放两者之间的协同作用。具体地，以自监督的方式训练共享深度解码器，以预测在源视图和目标视图中一致的深度图。我们的结果证明了我们的方法在解决这两项任务的挑战方面的有效性，这两项工作允许生成更高质量的图像，并为目标视点提供更准确的深度。 et.al.|[2308.14108](http://arxiv.org/abs/2308.14108)|**[link](https://github.com/johnminelli/twowaysynth)**|\n", "2308.14078": "|**2023-08-27**|**Sparse3D: Distilling Multiview-Consistent Diffusion for Object Reconstruction from Sparse Views**|从极其稀疏的视图重建3D对象是一个长期存在且具有挑战性的问题。虽然最近的技术使用图像扩散模型来在新视点生成看似合理的图像，或者使用分数蒸馏采样（SDS）将预先训练的扩散先验提取到3D表示中，但这些方法通常难以同时实现新视点合成（NVS）和几何体的高质量、一致和详细的结果。在这项工作中，我们提出了Sparse3D，这是一种为稀疏视图输入量身定制的新型3D重建方法。我们的方法从多视点一致扩散模型中提取鲁棒先验，以细化神经辐射场。具体来说，我们使用了一个控制器，该控制器利用输入视图中的核线特征，引导预先训练的扩散模型，如稳定扩散，以生成与输入保持3D一致性的新视图图像。通过利用强大的图像扩散模型中的2D先验，我们的集成模型即使在面对开放世界对象时也能始终如一地提供高质量的结果。为了解决传统SDS引入的模糊性，我们引入了类别分数蒸馏采样（C-SDS）来增强细节。我们在CO3DV2上进行了实验，这是一个真实世界对象的多视图数据集。定量和定性评估都表明，我们的方法在NVS和几何重建方面优于以往最先进的工作。 et.al.|[2308.14078](http://arxiv.org/abs/2308.14078)|null|\n", "2308.12967": "|**2023-08-24**|**NeO 360: Neural Fields for Sparse View Synthesis of Outdoor Scenes**|最近的隐式神经表示在新的视图合成中显示出了很好的结果。然而，现有的方法需要从许多视图进行昂贵的每场景优化，因此限制了它们在真实世界的无边界城市环境中的应用，在这些环境中，从极少数视图观察到感兴趣的对象或背景。为了缓解这一挑战，我们引入了一种名为NeO360的新方法，用于户外场景稀疏视图合成的神经场。NeO 360是一种可推广的方法，它从单个或几个摆出姿势的RGB图像重建360｛\\deg｝场景。我们方法的本质是捕捉复杂的真实世界户外3D场景的分布，并使用可以从任何世界点查询的混合图像条件三平面表示。我们的表示结合了基于体素和鸟瞰图（BEV）的最佳表示，比每种表示都更有效、更具表达力。NeO 360的表示使我们能够从大量无界3D场景中学习，同时在推理过程中从一张图像中提供对新视图和新场景的可推广性。我们在所提出的具有挑战性的360｛\\deg｝无界数据集NeRDS 360上演示了我们的方法，并表明NeO 360在新视图合成方面优于最先进的可推广方法，同时还提供编辑和合成功能。项目页面：https://zubair-irshad.github.io/projects/neo360.html et.al.|[2308.12967](http://arxiv.org/abs/2308.12967)|**[link](https://github.com/zubair-irshad/NeO-360)**|\n"}, "3D Reconstruction": {"2309.02436": "|**2023-09-05**|**GO-SLAM: Global Optimization for Consistent 3D Instant Reconstruction**|最近，神经隐式表示在密集同时定位和映射（SLAM）方面取得了令人信服的结果，但在相机跟踪和重建中存在误差积累和失真。有目的地，我们提出了GO-SLAM，这是一种基于深度学习的密集视觉SLAM框架，用于实时全局优化姿态和三维重建。鲁棒姿态估计是其核心，由有效的闭环和在线全束调整支持，通过利用输入帧完整历史的学习全局几何来优化每帧。同时，我们动态更新隐式和连续曲面表示，以确保三维重建的全局一致性。在各种合成和真实世界数据集上的结果表明，GO-SLAM在跟踪鲁棒性和重建精度方面优于最先进的方法。此外，GO-SLAM是通用的，可以与单眼、立体声和RGB-D输入一起运行。 et.al.|[2309.02436](http://arxiv.org/abs/2309.02436)|null|\n", "2309.02420": "|**2023-09-05**|**Doppelgangers: Learning to Disambiguate Images of Similar Structures**|我们考虑的视觉消歧任务是确定一对视觉相似的图像是否描绘了相同或不同的3D表面（例如，对称建筑的相同或相反侧）。两张图像观察到不同但在视觉上相似的3D表面，这对人类来说可能很难区分，也可能导致3D重建算法产生错误的结果。我们提出了一种基于学习的视觉消歧方法，将其表述为图像对的二元分类任务。为此，我们为这个问题引入了一个新的数据集，即Doppelgangers，它包括具有基本事实标签的相似结构的图像对。我们还设计了一种网络架构，将局部关键点和匹配的空间分布作为输入，从而能够更好地对局部和全局线索进行推理。我们的评估表明，我们的方法可以在困难的情况下区分虚幻的匹配，并可以集成到SfM管道中，以产生正确的、消除歧义的3D重建。有关我们的代码、数据集和更多结果，请参阅我们的项目页面：http://doppelgangers-3d.github.io/. et.al.|[2309.02420](http://arxiv.org/abs/2309.02420)|null|\n", "2309.02318": "|**2023-09-05**|**TiAVox: Time-aware Attenuation Voxels for Sparse-view 4D DSA Reconstruction**|四维数字减影血管造影（4D DSA）在许多医学疾病的诊断中起着至关重要的作用，如动静脉畸形（AVM）和动静脉瘘（AVF）。尽管4D DSA的重建具有重要的应用价值，但它需要大量的视图来有效地模拟复杂的血管和放射造影流，从而意味着显著的辐射剂量。为了解决这一高辐射问题，我们提出了一种用于稀疏视图4D DSA重建的时间感知衰减体素（TiAVox）方法，为高质量的4D成像铺平了道路。此外，可以从重建的4D DSA图像生成2D和3D DSA成像结果。TiAVox引入了4D衰减体素网格，从空间和时间维度反映衰减特性。它通过最小化渲染图像和稀疏2D DSA图像之间的差异来进行优化。在没有任何神经网络参与的情况下，TiAVox享有特定的物理可解释性。每个可学习体素的参数表示衰减系数。我们在临床和模拟数据集上验证了TiAVox方法，在临床来源的数据集上仅使用30个视图，就实现了31.23的新视图合成峰值信噪比（PSNR），而传统的Feldkamp-Davis-Kress方法需要133个视图。类似地，在合成数据集中只有10个视图的情况下，TiAVox对于新视图合成产生了34.32的PSNR，对于3D重建产生了41.40的PSNR。我们还进行了消融研究，以证实TiAVox的主要成分。该代码将公开提供。 et.al.|[2309.02318](http://arxiv.org/abs/2309.02318)|null|\n", "2309.02102": "|**2023-09-05**|**Iterative Superquadric Recomposition of 3D Objects from Multiple Views**|人类善于重组新物体，即他们可以识别未知物体之间的共性，从一般结构到更精细的细节，这是机器难以复制的能力。我们提出了一个框架ISCO，在不训练使用3D监督的模型的情况下，直接从2D视图使用3D超二次曲面作为语义部分来重新组合对象。为了实现这一点，我们优化了组成对象特定实例的超二次曲面参数，比较了其渲染的3D视图和2D图像轮廓。我们的ISCO框架在重建误差高的地方迭代地添加新的超二次曲面，首先提取目标对象的粗略区域，然后提取目标对象更精细的细节。通过这种简单的从粗到细的归纳偏差，ISCO为相关的对象部分提供了一致的超二次曲面，尽管没有任何语义监督。由于ISCO不训练任何神经网络，因此它对分布外的对象也具有固有的鲁棒性。实验表明，与最近的单实例超二次曲面重建方法相比，ISCO提供了持续更准确的3D重建，即使是从野外图像中也是如此。代码可在https://github.com/ExplainableML/ISCO。 et.al.|[2309.02102](http://arxiv.org/abs/2309.02102)|null|\n", "2309.00385": "|**2023-09-01**|**Dense Voxel 3D Reconstruction Using a Monocular Event Camera**|事件摄像机是受生物系统启发，专门捕捉亮度变化的传感器。与传统的基于帧的相机相比，这些新兴相机具有许多优势，包括高动态范围、高帧率和极低功耗。由于这些优势，事件摄像机越来越多地应用于各个领域，如帧插值、语义分割、里程计和SLAM。然而，它们在VR应用的3D重建中的应用还没有得到充分的探索。该领域以前的方法主要集中在通过深度图估计进行三维重建。产生密集3D重建的方法通常需要多个相机，而利用单个事件相机的方法只能产生半密集的结果。可以产生密集3D重建的其他单相机方法依赖于创建管道，该管道结合了上述方法或其他现有的运动结构（SfM）或多视图立体（MVS）方法。在本文中，我们提出了一种仅使用单个事件相机来解决密集三维重建的新方法。据我们所知，我们的工作是这方面的第一次尝试。我们的初步结果表明，所提出的方法可以直接产生视觉上可区分的密集三维重建，而不需要像现有方法那样使用管道。此外，我们还使用事件相机模拟器创建了一个合成数据集，其中包含39739$的对象扫描。该数据集将有助于加速该领域的其他相关研究。 et.al.|[2309.00385](http://arxiv.org/abs/2309.00385)|null|\n", "2309.00372": "|**2023-09-01**|**On the Localization of Ultrasound Image Slices within Point Distribution Models**|甲状腺疾病最常见的诊断方法是使用高分辨率超声（US）。纵向结节追踪是监测甲状腺病理形态变化的关键诊断方案。然而，由于维持器官的心理3D重建的固有挑战，这项任务给临床医生带来了巨大的认知负荷。因此，我们提出了一个在3D形状表示中自动定位US图像切片的框架，以简化如何进行这种超声诊断。我们提出的方法通过对比度量学习，学习US图像块和个人甲状腺形状的3D表面之间的共同潜在嵌入空间，或统计形状模型（SSM）形式的统计聚合。使用跨模态配准和Procrustes分析，我们利用模型中的特征将US切片配准为甲状腺形状的3D网格表示。我们证明了我们的多模态配准框架可以在患者特定器官的3D表面拓扑结构和SSM的平均形状上定位图像。实验结果表明，在患者特定的3D解剖结构上，切片位置可以在距离地面实况切片位置平均1.2毫米和SSM平均4.6毫米的范围内预测，这证明了其在超声采集期间对切片定位的有用性。代码公开：\\href{https://github.com/vuenc/slice-to-shape}{https://github.com/vuenc/slice-to-shape} et.al.|[2309.00372](http://arxiv.org/abs/2309.00372)|null|\n", "2309.00024": "|**2023-08-31**|**Efficient Multi-View Graph Clustering with Local and Global Structure Preservation**|基于锚点的多视图图聚类（AMVGC）由于其高效性和跨多个视图捕获互补结构信息的能力而受到广泛关注。直观地说，高质量的锚图对AMVGC的成功起着至关重要的作用。然而，现有的AMVGC方法只考虑单个结构信息，即局部或全局结构，这为学习任务提供了足够的信息。具体地说，过于分散的全局结构导致学习锚不能很好地描述集群划分。相反，具有不适当相似性度量的局部结构会导致潜在的不准确锚分配，最终导致次优聚类性能。为了解决这个问题，我们提出了一种新的基于锚点的多视图图聚类框架，称为具有局部和全局结构保护的高效多视图图集群（EMVGC-LG）。具体而言，设计了一个具有理论保障的统一框架，以获取本地和全球信息。此外，EMVGC-LG还联合优化了锚点构建和图学习，以提高聚类质量。此外，EMVGC-LG继承了现有AMVGC方法在样本数量方面的线性复杂性，这是时间经济的，并且可以很好地随数据大小扩展。大量的实验证明了我们提出的方法的有效性和效率。 et.al.|[2309.00024](http://arxiv.org/abs/2309.00024)|**[link](https://github.com/wy1019/emvgc-lg)**|\n", "2308.16278": "|**2023-08-30**|**Autonomous damage assessment of structural columns using low-cost micro aerial vehicles and multi-view computer vision**|结构柱是建筑和桥梁的重要承载构件。柱损坏的早期检测对于评估剩余性能和防止系统级崩溃非常重要。本研究提出了一种创新的基于端到端微型飞行器（MAV）的方法来自动扫描和检查立柱。首先，提出了一种基于MAV的图像自动采集方法。MAV被编程为感应结构柱及其周围环境。在导航过程中，MAV首先检测并接近结构柱。然后，它开始收集每个检测到的列周围多个视点的图像数据。其次，收集的图像将用于评估损坏类型和损坏位置。第三，将通过融合多个摄像机视图的评估结果来确定结构柱的损伤状态。在本研究中，选择钢筋混凝土（RC）柱来证明该方法的有效性。实验结果表明，所提出的基于MAV的检测方法可以有效地从多个视角采集图像，并准确评估RC柱的临界损伤。该方法提高了检查期间的自主权水平。此外，评估结果比现有的2D视觉方法更全面。所提出的检查方法的概念可以扩展到其他结构柱，如桥墩。 et.al.|[2308.16278](http://arxiv.org/abs/2308.16278)|null|\n", "2308.15984": "|**2023-08-30**|**Learning Structure-from-Motion with Graph Attention Networks**|在本文中，我们通过使用图注意力网络来解决从运动中学习结构（SfM）的问题。SfM是一个经典的计算机视觉问题，通过迭代最小化重投影误差来解决，称为束调整（BA），从良好的初始化开始。为了获得对BA足够好的初始化，传统方法依赖于一系列子问题（如成对姿态估计、姿态平均或三角测量），这些子问题提供了一个初始解决方案，然后可以使用BA进行细化。在这项工作中，我们通过学习一个模型来替换这些子问题，该模型将在多个视图中检测到的2D关键点作为输入，并输出相应的相机姿势和3D关键点坐标。我们的模型利用图神经网络来学习SfM特定的基元，并表明它可以用于新的和看不见的序列的重建的快速推理。实验结果表明，所提出的模型优于竞争的基于学习的方法，并在具有较低运行时间的同时挑战了COLMAP。 et.al.|[2308.15984](http://arxiv.org/abs/2308.15984)|null|\n", "2308.15619": "|**2023-08-29**|**Intensity correlation holography for remote phase sensing and 3D imaging**|全息是一种通过与参考波的干涉组合来测量光学信号波前的既定技术。传统上，全息图的积分时间受到干涉仪相干时间的限制，因此制备远程物体的全息图具有挑战性，尤其是使用弱照明。在这里，我们通过使用强度相关干涉测量法来规避这一限制。尽管单个全息图的曝光时间必须短于干涉仪相干时间，但我们表明，任何数量的随机相移全息图都可以组合成单个强度相关全息图。在原理验证实验中，我们使用该技术在弱照明和无主动相位稳定的情况下，对距离约3m的物体进行相位成像和3D重建。 et.al.|[2308.15619](http://arxiv.org/abs/2308.15619)|null|\n"}, "Diffusion": {"2309.02431": "|**2023-09-05**|**Crack propagation in anisotropic brittle materials: from a phase-field model to a shape optimization approach**|相场法基于能量最小化原理，能量最小化原理是一种用于建模扩散裂纹的几何方法，该方法通常基于Griffith准则以不可逆性实现。该方法需要一个长度尺度参数来平滑尖锐的不连续性，这会影响扩散带并导致网格敏感的裂缝传播结果。最近，提出了一种基于黎曼形状空间优化的新方法，其中通过形状优化技术来实现裂纹路径。这种方法需要形状导数，它是在连续意义上导出的，并用于基于梯度的算法，以最小化系统的能量。由于形状导数的连续推导，这种方法产生了与网格无关的结果。本文提出了一种基于形状优化的新方法，然后使用相场模型的数值计算来评估各向异性脆性材料的预测裂纹路径。 et.al.|[2309.02431](http://arxiv.org/abs/2309.02431)|null|\n", "2309.02405": "|**2023-09-05**|**Generating Realistic Images from In-the-wild Sounds**|将狂野的声音表示为图像是一项重要但具有挑战性的任务，因为声音和图像之间缺乏配对的数据集，并且这两种模式的特征存在显著差异。先前的研究集中在从有限类别的声音或音乐中生成图像。在这篇论文中，我们提出了一种从狂野的声音中生成图像的新方法。首先，我们使用音频字幕将声音转换为文本。其次，我们提出音频注意和句子注意来表现声音的丰富特征，并将声音形象化。最后，我们提出了一种使用CLIPscore和AudioCLIP的直接声音优化，并使用基于扩散的模型生成图像。在实验中，它表明我们的模型能够从野生声音中生成高质量的图像，并且在野生音频数据集的定量和定性评估中都优于基线。 et.al.|[2309.02405](http://arxiv.org/abs/2309.02405)|null|\n", "2309.02349": "|**2023-09-05**|**A Diffusion Quantum Monte Carlo Approach to the Polaritonic Ground State**|制造和使用极性态（即混合电子-光子态）用于化学应用最近已成为连接化学和量子光学社区的最突出和最活跃的领域之一。使用从头算方法对这种极性现象进行建模需要新的方法，从而重新发明了许多常用的电子结构方法，如Hartree-Fock、密度泛函和耦合簇理论。在这项工作中，我们探索了形式精确的扩散量子蒙特卡罗方法（DQMC），以获得H$_2$分子系统离解过程中极性基态的数值解。我们检查了整个离解过程中的各种电子-核-光子性质，如腔Born-Oppenheimer表面最小值的变化、电子波函数的局部化和平均模式占据。最后，我们直接将我们的结果与最先进的、近似的极性耦合簇方法获得的结果进行比较。 et.al.|[2309.02349](http://arxiv.org/abs/2309.02349)|null|\n", "2309.02319": "|**2023-09-05**|**Robust frequency-dependent diffusion kurtosis computation using an efficient direction scheme, axisymmetric modelling, and spatial regularization**|与传统的dMRI相比，使用振荡梯度编码和扩散峰度成像（DKI）技术的频率依赖性扩散MRI（dMRI）已被证明可以提供对组织微观结构的额外见解。然而，当组合这些技术时的技术挑战是，当使用振荡梯度扩散编码时，DKI所需的大b值的生成是困难的。虽然有效的编码方案可以通过同时最大化多个梯度通道来实现更大的b值，但它们没有足够的方向来实现全峰度张量的拟合。因此，我们研究了一种DKI拟合算法，该算法结合了轴对称DKI拟合（一种对所有振荡梯度频率强制相同对称轴的先验）和空间正则化，这两种算法共同实现了对10方向方案的稳健DKI拟合，与传统方向方案相比，该方案提供了两倍的b值。使用来自小鼠（振荡频率为0、60和120 Hz）和人类（仅0 Hz）的数据，我们首先表明，轴对称建模在保持对比度和减少DKI图中的噪声方面优于全峰度张量拟合，并且与具有更多编码方向的传统方案相比，当使用具有平均的有效编码方案时，提高了DKI图的质量。我们还展示了在拟合过程中的空间正则化如何比在拟合前使用高斯滤波更好地保留空间特征，高斯滤波是DKI的一个经常报道的预处理步骤，并且在频率上实施一致的对称轴可以提高拟合质量。因此，使用有效的10方向方案与所提出的DKI拟合算法相结合，提供了频率相关的方向峰度参数的稳健图，该图可用于探索各种病理的新生物标志物。 et.al.|[2309.02319](http://arxiv.org/abs/2309.02319)|null|\n", "2309.02299": "|**2023-09-05**|**Neuromorphic nanocluster networks: Critical role of the substrate in nano-link formation**|基于原子簇的网络是实现神经形态计算系统的一种很有前途的架构，它可以克服当前计算范式的一些局限性。集群之间突触的形成和破坏对这些计算系统的功能至关重要。本文报道了沉积在碳基底上的2.8纳米Au$_{1415}$簇在高温下突触（桥）形成和热断裂过程的分子动力学模拟结果，这是一个模型系统。至关重要的是，我们发现桥的形成过程是由金原子沿着基底的扩散驱动的，无论团簇之间的间隙多么小。断桥过程的互补模拟揭示了通过焦耳加热激活断桥的阈值偏置电压的存在。这些结果提供了对神经形态簇阵列中发生的基本动力学过程的原子级理解。 et.al.|[2309.02299](http://arxiv.org/abs/2309.02299)|null|\n", "2309.02222": "|**2023-09-05**|**Unconventional photo-induced charge-density-wave dynamics in 2H-NbSe$_{2}$**|我们使用近红外和可见光激发研究了二维2H-NbSe$_{2}$的共存超导（SC）和电荷密度波（CDW）相中与温度（$T$）相关的超快近红外（NIR）瞬态反射率动力学。在可见光泵浦光子激发（400nm）下，我们发现了一个存在于所有相中的慢高能准粒子弛豫通道。在CDW阶段，我们观察到一个独特的瞬态响应分量，与泵浦光子能量无关。该分量的特点是不存在相干振幅模式振荡和相对缓慢的皮秒上升时间，这与大多数典型的CDW材料不同。在SC相中，出现了另一个与SC相的光学抑制有关的微小成分。CDW相中的瞬态反射率弛豫由声子扩散过程主导，估计低-$T$热扩散常数各向异性为$\\sim30$。CDW相的强激发揭示了弱的非热CDW阶参数（OP）抑制。与具有较大间隙的CDW系统不同，其中光学OP抑制仅涉及声子自由度的一小部分，2H-NbSe$_{2}$中的OP抑制的特征是激发大量的声子自由度和显著较慢的动力学。 et.al.|[2309.02222](http://arxiv.org/abs/2309.02222)|null|\n", "2309.02218": "|**2023-09-05**|**Robustness and Generalizability of Deepfake Detection: A Study with Diffusion Models**|深度伪造图像的兴起，尤其是知名人士的图像，对真实信息的传播构成了严重威胁。为了解决这个问题，我们对deepfakes是如何生产的以及如何识别它们进行了彻底的调查。我们研究的基石是大量的人造名人脸，名为DeepFakeFace（DFF）。我们使用先进的扩散模型制作了DFF数据集，并通过在线平台与社区共享。这些数据为训练和测试用于发现deepfakes的算法奠定了坚实的基础。我们对DFF数据集进行了彻底的审查，并提出了两种评估方法来衡量深度伪造识别工具的强度和适应性。第一种方法测试在一种类型的假图像上训练的算法是否能够识别其他方法产生的假图像。第二个评估算法对不完美图像的性能，比如那些模糊、低质量或压缩的图像。考虑到深度伪造方法和图像变化的不同结果，我们的发现强调需要更好的深度伪造检测器。我们的DFF数据集和测试旨在促进针对deepfakes的更有效工具的开发。 et.al.|[2309.02218](http://arxiv.org/abs/2309.02218)|null|\n", "2309.02196": "|**2023-09-05**|**Finite dimensional backstepping controller design**|我们介绍了一种有限维版本的反推控制器设计，用于从边界稳定偏微分方程的解。与使用所有（无限多）模式的经典反推控制器相反，我们的控制器只使用有限数量的解状态傅立叶模式。我们将我们的方法应用于反应扩散方程，这只是一个典型的例子，但该方法也适用于其他偏微分方程，其解可以分解为慢有限维部分和快尾，其中前者在大时间内主导进化。其中一个主要目标是估计将工厂稳定在规定速率所需的足够数量的模式。此外，我们发现了在一定（未描述）衰变率下保证稳定的最小模式数。理论发现得到了数值解的支持。 et.al.|[2309.02196](http://arxiv.org/abs/2309.02196)|null|\n", "2309.02129": "|**2023-09-05**|**Quasiparticles for the one-dimensional nonlocal Fisher-Kolmogorov-Petrovskii-Piskunov equation**|利用弱扩散近似中的半经典集中态方法，构造了具有非局部非线性的一维Fisher—Kolmogorov—Petrovskii—Piskunov（FKPP）的类准粒子解。这样的解决方案对于预测人口模式的动态是有用的。准粒子的相互作用源于FKPP模型中的非局部竞争损失。我们依靠马斯洛夫方法的思想发展了我们方法的形式主义。原始非线性发展方程解的渐近展开式的构造是基于常微分方程的辅助动力系统的解。在所提出的方法的框架内，研究了与再现率和非局部竞争损失的不同空间分布相对应的各种特定情况的渐近解。 et.al.|[2309.02129](http://arxiv.org/abs/2309.02129)|null|\n", "2309.02121": "|**2023-09-05**|**Wiometrics: Comparative Performance of Artificial Neural Networks for Wireless Navigation**|无线电信号被广泛用作导航辅助设备，当前和未来的地面无线通信系统具有使其两用性具有吸引力的特性。低于6GHz的载波频率实现了数据通信和导航的广泛覆盖，但通常提供较小的带宽和有限的分辨率来精确估计几何形状，特别是在传播信道在时间和/或空间上分散的环境中。在商业和文献中，非参数方法在此类场景中都取得了一定的成功，但通常强调低成本硬件和简单的传播模型，或者模拟不能完全捕捉硬件损伤和复杂的传播机制。在这篇文章中，我们使用安装在城市非视距场景中的乘用车上的软件定义的无线电和大规模天线阵列，以及车辆姿态的地面实况参考，对商业蜂窝网络传输的下行链路信号进行了机会观测。以这些观测值为输入，我们使用人工神经网络为各种人工神经网络架构和输入观测数据的不同表示生成车辆位置和航向的估计值，我们称之为wiometrics，并比较导航性能。对于网络和wiometrics的最佳组合，可以实现几米量级的位置精度和几度的航向精度。基于实验结果，我们使用统计方法得出了关于无线导航未来可能方向的结论。 et.al.|[2309.02121](http://arxiv.org/abs/2309.02121)|null|\n"}, "NeRF": {"2308.16891": "|**2023-09-01**|**GNFactor: Multi-Task Real Robot Learning with Generalizable Neural Feature Fields**|开发能够在非结构化现实世界环境中通过视觉观察执行各种操作任务的代理是机器人技术中的一个长期问题。为了实现这一目标，机器人需要对场景的3D结构和语义有全面的了解。在这项工作中，我们提出了$\\textbf｛GNFactor｝$，一种用于多任务机器人操作的视觉行为克隆代理，具有$\\textbf｛G｝$通用$\\textbf｛N｝$eural功能$\\textbf｛F｝$字段。GNFactor联合优化了作为重建模块的可推广神经场（GNF）和作为决策模块的感知转换器，利用了共享的深度3D体素表示。为了在3D中结合语义，重建模块利用视觉语言基础模型（$\\textit｛例如｝$，Stable Diffusion）将丰富的语义信息提取到深度3D体素中。我们在3个真实机器人任务中评估了GNFactor，并在10个RLBench任务中进行了详细的消融，演示次数有限。我们观察到GNFactor在可见和不可见任务中比当前最先进的方法有了实质性的改进，证明了GNFactor强大的泛化能力。我们的项目网站是https://yanjieze.com/GNFactor/。 et.al.|[2308.16891](http://arxiv.org/abs/2308.16891)|**[link](https://github.com/YanjieZe/GNFactor)**|\n", "2308.16246": "|**2023-08-30**|**Active Neural Mapping**|我们用不断学习的神经场景表示来解决主动映射的问题，即主动神经映射。关键在于通过有效的代理移动积极找到要探索的目标空间，从而最大限度地减少在以前看不见的环境中飞行中的地图不确定性。在本文中，我们检验了连续学习神经场的权重空间，并从经验上表明，神经变异性，即对随机权重扰动的预测鲁棒性，可以直接用于测量神经映射的瞬时不确定性。结合神经映射中继承的连续几何信息，可以引导agent找到一条可遍历的路径，以逐渐获得环境知识。我们首次提出了一种用于在线场景重建的具有基于坐标的隐式神经表示的主动映射系统。在视觉逼真的Gibson和Matterport3D环境中的实验证明了所提出方法的有效性。 et.al.|[2308.16246](http://arxiv.org/abs/2308.16246)|null|\n", "2308.15461": "|**2023-08-29**|**Canonical Factors for Hybrid Neural Fields**|因子特征量提供了一种简单的方法来构建更紧凑、高效和可积分的神经场，但也引入了对真实世界数据不一定有益的偏差。在这项工作中，我们（1）描述了这些架构对轴对准信号的不希望有的偏差——它们可能导致高达2 PSNR的辐射场重建差异——以及（2）探索了学习一组规范化变换如何通过消除这些偏差来改进表示。我们在二维模型问题中证明，同时学习这些变换和场景外观是成功的，效率大大提高。我们使用图像、符号距离和辐射场重建任务验证了最终的架构，我们称之为TILTED，在这些任务中，我们观察到了质量、稳健性、紧凑性和运行时间方面的改进。结果表明，TILTED可以实现比基线大2倍的能力，同时突出神经场评估程序的弱点。 et.al.|[2308.15461](http://arxiv.org/abs/2308.15461)|null|\n", "2308.14847": "|**2023-08-30**|**NSF: Neural Surface Fields for Human Modeling from Monocular Depth**|从单眼相机获得个性化的3D可动画化化身在游戏、虚拟试穿、动画和VR/XR等领域有几个现实世界的应用。然而，从这种稀疏的数据中建模动态和细粒度的服装变形是非常具有挑战性的。现有的从深度数据建模3D人类的方法在计算效率、网格一致性以及分辨率和拓扑结构的灵活性方面具有局限性。例如，使用隐式函数重建形状和每帧提取显式网格在计算上是昂贵的，并且不能确保跨帧的连贯网格。此外，在具有离散表面的预先设计的人类模板上预测每个顶点的变形在分辨率和拓扑结构上缺乏灵活性。为了克服这些局限性，我们提出了一种新的方法“关键特征：神经表面场”，用于从单目深度对穿着3D衣服的人类进行建模。NSF仅在基面上定义了一个神经场，该神经场对连续和灵活的位移场进行建模。NSF可以适应不同分辨率和拓扑结构的基面，而无需在推理时进行重新训练。与现有方法相比，我们的方法在保持网格一致性的同时消除了昂贵的每帧表面提取，并且能够在不重新训练的情况下重建任意分辨率的网格。为了促进这方面的研究，我们在项目页面上发布了我们的代码：https://yuxuan-xue.com/nsf. et.al.|[2308.14847](http://arxiv.org/abs/2308.14847)|null|\n", "2308.14610": "|**2023-08-28**|**A Transformer-Conditioned Neural Fields Pipeline with Polar Coordinate Representation for Astronomical Radio Interferometric Data Reconstruction**|在射电天文学中，能见度数据是对射电望远镜波信号的测量，被转换成图像，用于观测遥远的天体。然而，由于信号稀疏性和其他因素，这些结果图像通常包含真实源和伪影。获得更干净图像的一种方法是在成像之前将样本重建成致密的形式。不幸的是，现有的可见性重建方法可能会错过频率数据的一些分量，因此模糊的对象边缘和持久的伪影仍然存在于图像中。此外，由于数据偏斜，在不规则可见性样本上的计算开销很高。为了解决这些问题，我们提出了PolarRec，这是一种干涉能见度数据的重建方法，它由具有极坐标表示的变压器条件神经场管道组成。这种表示与望远镜在地球自转时观察天体区域的方式相匹配。我们进一步提出了径向频率损失函数，使用极坐标系中的径向坐标与频率信息进行关联，以帮助重建完整的可见性。我们还根据极坐标系中的角坐标对可见性采样点进行分组，并使用分组作为随后使用Transformer编码器进行编码的粒度。因此，我们的方法可以有效地捕捉可见性数据的固有特征。我们的实验表明，PolarRec通过忠实地重建可见性域中的所有频率分量，显著提高了成像结果，同时显著降低了计算成本。 et.al.|[2308.14610](http://arxiv.org/abs/2308.14610)|null|\n", "2308.12967": "|**2023-08-24**|**NeO 360: Neural Fields for Sparse View Synthesis of Outdoor Scenes**|最近的隐式神经表示在新的视图合成中显示出了很好的结果。然而，现有的方法需要从许多视图进行昂贵的每场景优化，因此限制了它们在真实世界的无边界城市环境中的应用，在这些环境中，从极少数视图观察到感兴趣的对象或背景。为了缓解这一挑战，我们引入了一种名为NeO360的新方法，用于户外场景稀疏视图合成的神经场。NeO 360是一种可推广的方法，它从单个或几个摆出姿势的RGB图像重建360｛\\deg｝场景。我们方法的本质是捕捉复杂的真实世界户外3D场景的分布，并使用可以从任何世界点查询的混合图像条件三平面表示。我们的表示结合了基于体素和鸟瞰图（BEV）的最佳表示，比每种表示都更有效、更具表达力。NeO 360的表示使我们能够从大量无界3D场景中学习，同时在推理过程中从一张图像中提供对新视图和新场景的可推广性。我们在所提出的具有挑战性的360｛\\deg｝无界数据集NeRDS 360上演示了我们的方法，并表明NeO 360在新视图合成方面优于最先进的可推广方法，同时还提供编辑和合成功能。项目页面：https://zubair-irshad.github.io/projects/neo360.html et.al.|[2308.12967](http://arxiv.org/abs/2308.12967)|**[link](https://github.com/zubair-irshad/NeO-360)**|\n", "2308.11916": "|**2023-08-23**|**Semantic-Aware Implicit Template Learning via Part Deformation Consistency**|学习隐式模板作为神经场最近在无监督形状对应方面表现出了令人印象深刻的性能。尽管取得了成功，但我们观察到，目前仅依赖几何信息的方法往往会在具有高结构可变性的通用物体形状中学习次优变形。在本文中，我们强调了零件变形一致性的重要性，并提出了一个语义感知的隐式模板学习框架，以实现语义上合理的变形。通过利用自监督特征提取器的语义先验，我们建议使用新的语义感知变形代码进行局部条件调节，并对零件变形、全局变形和全局缩放进行变形一致性正则化。我们的大量实验证明了所提出的方法在各种任务中优于基线：关键点转移、零件标签转移和纹理转移。更有趣的是，我们的框架在更具挑战性的环境下显示出更大的性能提升。我们还提供了定性分析来验证语义感知变形的有效性。代码可在https://github.com/mlvlab/PDC. et.al.|[2308.11916](http://arxiv.org/abs/2308.11916)|null|\n", "2308.11300": "|**2023-08-22**|**Approaching human 3D shape perception with neurally mappable models**|人类毫不费力地推断出物体的三维形状。这种能力的基础是什么计算？尽管已经提出了各种计算模型，但它们都没有捕捉到人类在不同视点之间匹配物体形状的能力。在这里，我们询问是否以及如何缩小这一差距。我们从一类相对新颖的计算模型3D神经场开始，它通过深度神经网络（DNN）中的合成封装了经典分析的基本原理。首先，我们发现3D光场网络（3D-LFN）支持与人类完全一致的3D匹配判断，用于类别内比较、强调标准DNN模型的3D失败情况的对抗性定义比较，以及用于无类别结构的算法生成形状的对抗性定义比较。然后，我们通过一系列计算实验研究了3D-LFN实现人类对齐性能的能力来源。在训练过程中暴露于物体的多个视角和多视角学习目标是模型-人对齐背后的主要因素；当使用多视图目标进行训练时，即使是传统的DNN架构也更接近人类行为。最后，我们发现，虽然用多视图学习目标训练的模型能够部分推广到新的对象类别，但它们不能达到人类的一致性。这项工作为理解可神经映射的计算架构中的人形推断提供了基础，并突出了未来工作的重要问题。 et.al.|[2308.11300](http://arxiv.org/abs/2308.11300)|null|\n", "2308.10645": "|**2023-08-21**|**Canonical Cortical Field Theories**|我们根据场论，使用放置在皮层表面2D晶格上的神经单元来表征神经元活动的动力学。分析神经元单元的电活动，目的是推导出一个具有简单功能形式的神经场模型，该模型仍然能够预测或重现经验发现。使用神经质量对每个神经单元进行建模，并在连续极限中导出伴随的场论。场论包括耦合的（真实的）克莱因-戈登场，其中模型的预测属于实验结果的范围。这些预测包括从皮层测量的电活动频谱，该频谱是使用能量对神经场本征函数的平分得出的。此外，神经场模型在一组参数内对用于建模每个神经元质量的动力学系统是不变的。具体而言，拓扑等效的动力学系统在连接到晶格中时产生相同的神经场模型；这表明所导出的场可以被解读为典型的皮层场论。我们专门研究了为传入信息的编码（或表示）提供结构的非分散场。进一步阐述随后的神经场理论，包括分散力的影响，对于理解皮层对信息的处理可能具有重要意义。 et.al.|[2308.10645](http://arxiv.org/abs/2308.10645)|null|\n", "2308.07032": "|**2023-08-14**|**S3IM: Stochastic Structural SIMilarity and Its Unreasonable Effectiveness for Neural Fields**|最近，神经辐射场（NeRF）通过学习仅使用姿态RGB图像的隐式表示，在渲染给定场景的新视图图像方面取得了巨大成功。NeRF和相关的神经场方法（例如，神经表面表示）通常优化逐点损失并进行逐点预测，其中一个数据点对应于一个像素。不幸的是，这一研究未能使用对远处像素的集体监督，尽管已知图像或场景中的像素可以提供丰富的结构信息。据我们所知，我们是第一个通过一种新的随机结构相似性（S3IM）损失为NeRF和相关神经场方法设计非局部多重训练范式的人，该损失将多个数据点作为一个整体处理，而不是独立处理多个输入。我们的大量实验证明了S3IM在几乎免费改进NeRF和神经表面表示方面的不合理有效性。质量度量的改进对于那些相对困难的任务可能特别显著：例如，TensoRF和DVGO在八个新的视图合成任务中的测试MSE损失意外下降了90%以上；在八个表面重建任务中，NeuS的198%F分数增益和64%的倒角$L_。此外，即使在稀疏输入、损坏图像和动态场景的情况下，S3IM也始终是稳健的。 et.al.|[2308.07032](http://arxiv.org/abs/2308.07032)|**[link](https://github.com/madaoer/s3im_nerf)**|\n"}}