{"3D": {"2310.17994": "|**2023-10-27**|**ZeroNVS: Zero-Shot 360-Degree View Synthesis from a Single Real Image**|我们介绍了一种3D感知扩散模型ZeroNVS，用于野外场景的单图像新颖视图合成。虽然现有的方法是为具有遮罩背景的单个对象设计的，但我们提出了新的技术来解决具有复杂背景的野外多对象场景带来的挑战。具体来说，我们在捕捉以对象为中心、室内和室外场景的混合数据源上训练生成先验。为了解决深度尺度模糊等数据混合问题，我们提出了一种新的相机条件参数化和归一化方案。此外，我们观察到，在360度场景的提取过程中，分数提取采样（SDS）倾向于截断复杂背景的分布，并提出了“SDS锚定”来提高合成新视图的多样性。我们的模型在零样本设置中的DTU数据集上的LPIPS中设置了新的最先进的结果，甚至优于专门在DTU上训练的方法。我们进一步将具有挑战性的Mip-NeRF 360数据集作为单图像新视图合成的新基准，并在该设置中展示了强大的性能。我们的代码和数据位于http://kylesargent.github.io/zeronvs/ et.al.|[2310.17994](http://arxiv.org/abs/2310.17994)|null|\n", "2310.17880": "|**2023-10-27**|**Reconstructive Latent-Space Neural Radiance Fields for Efficient 3D Scene Representations**|神经辐射场（NeRF）已被证明是强大的3D表示，能够对复杂场景进行高质量的新颖视图合成。虽然NeRF已经应用于图形、视觉和机器人，但渲染速度慢和特有的视觉伪影问题阻碍了在许多用例中的采用。在这项工作中，我们研究了将自动编码器（AE）与NeRF相结合，其中潜在特征（而不是颜色）被渲染，然后进行卷积解码。由此产生的潜在空间NeRF可以产生比标准颜色空间NeRF质量更高的新颖视图，因为AE可以校正某些视觉伪影，同时渲染速度快三倍以上。我们的工作与提高NeRF效率的其他技术正交。此外，我们可以通过缩小AE架构来控制效率和图像质量之间的权衡，在性能下降很小的情况下实现13倍以上的渲染速度。我们希望我们的方法能够为下游任务形成高效但高保真的3D场景表示的基础，尤其是在保持可微性很有用的情况下，就像在许多需要持续学习的机器人场景中一样。 et.al.|[2310.17880](http://arxiv.org/abs/2310.17880)|null|\n", "2310.16832": "|**2023-10-26**|**LightSpeed: Light and Fast Neural Light Fields on Mobile Devices**|由于计算能力和存储空间有限，移动设备上的实时新视图图像合成是令人望而却步的。在移动设备上使用体积渲染方法（如NeRF及其衍生物）是不合适的，因为体积渲染的计算成本很高。另一方面，神经光场表示的最新进展在移动设备上显示出了有希望的实时视图合成结果。神经光场方法学习从光线表示到像素颜色的直接映射。光线表示的当前选择是分层光线采样或Plucker坐标，忽略了经典的光板（两平面）表示，这是在光场视图之间插值的首选表示。在这项工作中，我们发现使用光板表示是学习神经光场的有效表示。更重要的是，它是一种较低维的光线表示，使我们能够使用训练和渲染速度明显更快的特征网格来学习4D光线空间。尽管主要是为正面视图设计的，但我们表明，光板表示可以使用分而治之的策略进一步扩展到非正面场景。与以前的光场方法相比，我们的方法提供了卓越的渲染质量，并显著改善了渲染质量和速度之间的平衡。 et.al.|[2310.16832](http://arxiv.org/abs/2310.16832)|**[link](https://github.com/lightspeed-r2l/lightspeed)**|\n", "2310.16831": "|**2023-10-25**|**PERF: Panoramic Neural Radiance Field from a Single Panorama**|神经辐射场（NeRF）在给定多视点图像的新视点合成方面取得了实质性进展。最近，一些工作试图从具有3D先验的单个图像中训练NeRF。它们主要关注有限的视野，几乎没有不可见的遮挡，这大大限制了它们在具有大遮挡的真实世界360度全景场景中的可扩展性。在本文中，我们提出了PERF，这是一种360度新颖的视图合成框架，它从单个全景训练全景神经辐射场。值得注意的是，PERF允许在复杂场景中进行3D漫游，而无需昂贵且乏味的图像采集。为了实现这一目标，我们提出了一种新的协作RGBD修复方法和一种渐进的修复和擦除方法，以将360度2D场景提升为3D场景。具体而言，我们首先预测全景深度图作为给定单个全景的初始化，并使用体绘制重建可见的3D区域。然后，我们在NeRF中引入了一种协作的RGBD修复方法，用于从随机视图中完成RGB图像和深度图，该方法源自RGB稳定扩散模型和单目深度估计器。最后，我们介绍了一种修复和擦除策略，以避免新采样视图和参考视图之间的几何不一致。这两个组件在统一的优化框架中集成到NeRF的学习中，并取得了有希望的结果。在Replica和野外新数据集PERF上进行的大量实验证明了我们的PERF优于最先进的方法。我们的PERF可以广泛用于真实世界的应用，如全景到3D、文本到3D和3D场景风格化应用。项目页面和代码可在https://perf-project.github.io/. et.al.|[2310.16831](http://arxiv.org/abs/2310.16831)|**[link](https://github.com/perf-project/PeRF)**|\n", "2310.16383": "|**2023-10-25**|**Open-NeRF: Towards Open Vocabulary NeRF Decomposition**|在本文中，我们解决了从开放词汇中将神经辐射场（NeRF）分解为对象的挑战，这是三维重建和视图合成中对象操作的关键任务。当前的NeRF分解技术涉及处理开放词汇查询的灵活性和3D分割的准确性之间的权衡。我们提出了开放词汇嵌入式神经辐射场（Open NeRF），它利用了大规模现成的分割模型，如Segment Anything Model（SAM），并引入了一种具有分层嵌入的集成和提取范式，以实现开放词汇查询的灵活性和3D分割的准确性。Open NeRF首先利用大规模基础模型从不同的角度生成分层2D掩模方案。然后，通过跟踪方法将这些建议对齐，并将其集成在3D空间中，随后将其提取到3D领域中。这一过程确保了从不同角度对对象的一致识别和粒度，即使在涉及遮挡和模糊特征的具有挑战性的场景中也是如此。我们的实验结果表明，在开放词汇场景中，所提出的Open NeRF优于最先进的方法，如LERF\\cite{LERF}和FFD\\cite{FFD}。Open NeRF为NeRF分解提供了一个很有前途的解决方案，以开放词汇查询为指导，在开放世界3D场景中实现机器人和视觉语言交互的新应用。 et.al.|[2310.16383](http://arxiv.org/abs/2310.16383)|null|\n", "2310.16167": "|**2023-10-24**|**iNVS: Repurposing Diffusion Inpainters for Novel View Synthesis**|我们提出了一种从单一源图像生成一致新颖视图的方法。我们的方法侧重于最大限度地重用源图像中的可见像素。为了实现这一点，我们使用单目深度估计器，将可见像素从源视图转移到目标视图。从预先训练的2D修复扩散模型开始，我们在大规模Ob厌恶数据集上训练我们的方法来学习3D对象先验。在训练时，我们使用了一种基于核线的新型掩蔽机制来进一步提高我们的方法的质量。这使得我们的框架能够对各种对象执行零样本新颖的视图合成。我们在三个具有挑战性的数据集上评估了我们框架的零样本能力：谷歌扫描对象、光线跟踪多视图和3D中的常见对象。查看我们的网页了解更多详细信息：https://yashkant.github.io/invs/ et.al.|[2310.16167](http://arxiv.org/abs/2310.16167)|null|\n", "2310.14642": "|**2023-10-23**|**Relit-NeuLF: Efficient Relighting and Novel View Synthesis via Neural 4D Light Field**|在本文中，我们解决了在光源数量有限的情况下，从多视图图像中同时重新照明和合成复杂场景的新视图的问题。我们提出了一种称为Relit NeuLF的分析综合方法。继最近的神经4D光场网络（NeuLF）之后，Relit NeuLF首先利用两平面光场表示来参数化4D坐标系中的每条光线，从而实现高效的学习和推理。然后，我们以自监督的方式恢复三维场景的空间变化双向反射率分布函数（SVBRDF）。DecomposeNet学习将每条光线映射到其SVBRDF组件：反照率、法线和粗糙度。基于分解的BRDF分量和条件光方向，RenderNet学习合成光线的颜色。为了自我监督SVBRDF分解，我们鼓励使用微平面模型使预测的光线颜色接近基于物理的渲染结果。综合实验表明，该方法在合成数据和真实人脸数据上都是有效的，并且优于最先进的结果。我们在GitHub上公开发布了我们的代码。你可以在这里找到它：https://github.com/oppo-us-research/RelitNeuLF et.al.|[2310.14642](http://arxiv.org/abs/2310.14642)|**[link](https://github.com/oppo-us-research/relitneulf)**|\n", "2310.14487": "|**2023-10-23**|**VQ-NeRF: Vector Quantization Enhances Implicit Neural Representations**|隐式神经表示的最新进展有助于高保真度的表面重建和真实感的新视图合成。然而，这些方法中固有的计算复杂性是一个巨大的障碍，限制了实际应用中可达到的帧速率和分辨率。针对这一困境，我们提出了VQ-NeRF，这是一种通过矢量量化增强隐式神经表示的有效管道。我们的方法的本质包括将NeRF的采样空间减少到较低的分辨率，然后使用预训练的VAE解码器将其恢复到原始大小，从而有效地缓解渲染过程中遇到的采样时间瓶颈。尽管码本提供了代表性的特征，但由于高压缩率，重建场景的精细纹理细节仍然具有挑战性。为了克服这一限制，我们设计了一种创新的多尺度NeRF采样方案，该方案在压缩和原始尺度上同时优化NeRF模型，以增强网络保存精细细节的能力。此外，我们引入了语义损失函数，以提高三维重建的几何保真度和语义连贯性。大量实验证明了我们的模型在实现渲染质量和效率之间的最佳权衡方面的有效性。对DTU、BlendMVS和H3DS数据集的评估证实了我们方法的卓越性能。 et.al.|[2310.14487](http://arxiv.org/abs/2310.14487)|null|\n", "2310.13670": "|**2023-10-20**|**ManifoldNeRF: View-dependent Image Feature Supervision for Few-shot Neural Radiance Fields**|随着神经辐射场（NeRF）的出现，新的视图合成最近取得了重大进展。DietNeRF是NeRF的扩展，旨在通过为没有输入图像的未知视点引入新的损失函数，仅从少数图像中实现这一任务。损失函数假设预先训练的特征提取器应该输出相同的特征，即使输入图像是在不同的视点捕获的，因为图像包含相同的对象。然而，尽管这种假设是理想的，但在现实中，众所周知，随着视点的不断变化，特征向量也在不断变化。因此，这种假设可能会损害训练。为了避免这种有害的训练，我们提出了ManifoldNeRF，这是一种使用来自相邻已知视点的插值特征来监督未知视点的特征向量的方法。由于该方法通过插值特征为每个未知视点提供了适当的监督，因此体积表示比DietNeRF学习得更好。实验结果表明，在复杂场景下，该方法的性能优于其他方法。我们还对一组视点中的几个视点子集进行了实验，并为真实环境确定了一组有效的视点。这为实际应用程序提供了视点模式的基本策略。代码可在https://github.com/haganelego/ManifoldNeRF_BMVC2023 et.al.|[2310.13670](http://arxiv.org/abs/2310.13670)|null|\n", "2310.12877": "|**2023-10-23**|**Perceptual Assessment and Optimization of High Dynamic Range Image Rendering**|高动态范围（HDR）成像由于能够忠实地再现自然场景中的亮度水平而越来越受欢迎。因此，HDR图像质量评估（IQA）是至关重要的，但已被肤浅地处理。大多数现有的IQA模型都是针对低动态范围（LDR）图像开发和校准的，低动态范围图像已被证明与人类对HDR图像质量的感知相关性较差。在这项工作中，我们通过转移LDR IQA的最新进展，提出了一系列HDR IQA模型。我们方法的关键步骤是指定一个简单的反向显示模型，该模型将HDR图像分解为一组具有不同曝光的LDR图像，这些图像将由现有的LDR质量模型进行评估。然后，在简单的良好曝光度测量的帮助下，将每个曝光的局部质量分数聚合为每个曝光的全局质量分数，该全局质量分数将在曝光之间进一步加权，以获得总体质量分数。在评估LDR图像时，所提出的HDR质量模型优雅地降低到具有相同性能的原始LDR模型。在四个人类评级的HDR图像数据集上的实验表明，我们的HDR质量模型始终优于现有的IQA方法，包括HDR-VDP系列。此外，我们还展示了它们在HDR新视图合成的感知优化方面的优势。 et.al.|[2310.12877](http://arxiv.org/abs/2310.12877)|null|\n"}, "3D Reconstruction": {"2310.16383": "|**2023-10-25**|**Open-NeRF: Towards Open Vocabulary NeRF Decomposition**|在本文中，我们解决了从开放词汇中将神经辐射场（NeRF）分解为对象的挑战，这是三维重建和视图合成中对象操作的关键任务。当前的NeRF分解技术涉及处理开放词汇查询的灵活性和3D分割的准确性之间的权衡。我们提出了开放词汇嵌入式神经辐射场（Open NeRF），它利用了大规模现成的分割模型，如Segment Anything Model（SAM），并引入了一种具有分层嵌入的集成和提取范式，以实现开放词汇查询的灵活性和3D分割的准确性。Open NeRF首先利用大规模基础模型从不同的角度生成分层2D掩模方案。然后，通过跟踪方法将这些建议对齐，并将其集成在3D空间中，随后将其提取到3D领域中。这一过程确保了从不同角度对对象的一致识别和粒度，即使在涉及遮挡和模糊特征的具有挑战性的场景中也是如此。我们的实验结果表明，在开放词汇场景中，所提出的Open NeRF优于最先进的方法，如LERF\\cite{LERF}和FFD\\cite{FFD}。Open NeRF为NeRF分解提供了一个很有前途的解决方案，以开放词汇查询为指导，在开放世界3D场景中实现机器人和视觉语言交互的新应用。 et.al.|[2310.16383](http://arxiv.org/abs/2310.16383)|null|\n", "2310.15130": "|**2023-10-23**|**Novel-View Acoustic Synthesis from 3D Reconstructed Rooms**|我们研究了将盲音频记录与3D场景信息相结合用于新视图声学合成的好处。给定2-4个麦克风的音频记录以及包含多个未知声源的场景的3D几何形状和材料，我们估计场景中任何地方的声音。我们确定了新观点声学合成的主要挑战是声源定位、分离和去混响。虽然天真地训练端到端网络无法产生高质量的结果，但我们表明，结合从3D重建房间中导出的房间脉冲响应（RIR）使同一网络能够联合处理这些任务。我们的方法优于为单个任务设计的现有方法，证明了它在利用3D视觉信息方面的有效性。在对Matterport3D NVAS数据集的模拟研究中，我们的模型在源定位方面实现了近乎完美的精度，在源分离和去混响方面实现了26.44dB的PSNR和14.23dB的SDR，在新视图声学合成方面实现了25.55dB的PSNR和14.20dB的SDR。代码、预训练模型和视频结果可在项目网页上获得(https://github.com/apple/ml-nvas3d)。 et.al.|[2310.15130](http://arxiv.org/abs/2310.15130)|**[link](https://github.com/apple/ml-nvas3d)**|\n", "2310.14700": "|**2023-10-23**|**Interaction-Driven Active 3D Reconstruction with Object Interiors**|我们介绍了一种主动三维重建方法，该方法集成了视觉感知、机器人-物体交互和三维扫描，以恢复目标三维物体的外部和内部，即未暴露的几何形状。与主动视觉中专注于优化相机视点以更好地研究环境的其他工作不同，我们重建的主要特征是分析目标物体各个部分的相互作用性，以及机器人随后进行的部分操作，以实现对遮挡区域的扫描。因此，在完整的几何结构采集的基础上，获得了对目标物体的部分关节的理解。我们的方法由一个内置RGBD传感器的Fetch机器人完全自动操作。它在交互分析和交互驱动的重建之间迭代，一次扫描和重建检测到的可移动零件，其中关节零件检测和网格重建都由神经网络执行。在最后一步中，重建所有剩余的非铰接部件，包括通过先前部件操作暴露并随后扫描的所有内部结构，以完成采集。我们通过定性和定量评估、消融研究、与替代方案的比较以及在真实环境中的实验来证明我们的方法的性能。 et.al.|[2310.14700](http://arxiv.org/abs/2310.14700)|null|\n", "2310.14487": "|**2023-10-23**|**VQ-NeRF: Vector Quantization Enhances Implicit Neural Representations**|隐式神经表示的最新进展有助于高保真度的表面重建和真实感的新视图合成。然而，这些方法中固有的计算复杂性是一个巨大的障碍，限制了实际应用中可达到的帧速率和分辨率。针对这一困境，我们提出了VQ-NeRF，这是一种通过矢量量化增强隐式神经表示的有效管道。我们的方法的本质包括将NeRF的采样空间减少到较低的分辨率，然后使用预训练的VAE解码器将其恢复到原始大小，从而有效地缓解渲染过程中遇到的采样时间瓶颈。尽管码本提供了代表性的特征，但由于高压缩率，重建场景的精细纹理细节仍然具有挑战性。为了克服这一限制，我们设计了一种创新的多尺度NeRF采样方案，该方案在压缩和原始尺度上同时优化NeRF模型，以增强网络保存精细细节的能力。此外，我们引入了语义损失函数，以提高三维重建的几何保真度和语义连贯性。大量实验证明了我们的模型在实现渲染质量和效率之间的最佳权衡方面的有效性。对DTU、BlendMVS和H3DS数据集的评估证实了我们方法的卓越性能。 et.al.|[2310.14487](http://arxiv.org/abs/2310.14487)|null|\n", "2310.14364": "|**2023-10-22**|**A Quantitative Evaluation of Dense 3D Reconstruction of Sinus Anatomy from Monocular Endoscopic Video**|根据内窥镜视频生成准确的3D重建是对鼻窦解剖结构和手术结果进行纵向无辐射分析的一种很有前途的途径。已经提出了几种单目重建方法，通过从运动类型算法中检索具有结构的相对相机姿态并融合单目深度估计，产生视觉上令人愉快的3D解剖结构。然而，由于底层算法和内窥镜场景的复杂特性，重建管道可能表现不佳或意外失败。此外，获取医疗数据带来了额外的挑战，在定量基准测试这些模型、了解故障案例和确定有助于其准确性的关键组件方面存在困难。在这项工作中，我们对一种自监督的鼻窦重建方法进行了定量分析，该方法使用内窥镜序列与从9个离体标本中采集的光学跟踪和高分辨率计算机断层扫描相结合。我们的结果表明，生成的重建与解剖结构高度一致，在重建和CT分割之间产生0.91mm的平均点到网格误差。然而，在与内窥镜跟踪和导航相关的点对点匹配场景中，我们发现平均目标配准误差为6.58 mm。我们发现，姿态和深度估计的不准确度对该误差的贡献相同，轨迹较短的局部一致序列会产生更准确的重建。这些结果表明，实现相对相机姿态和估计深度与解剖结构之间的全局一致性至关重要。通过这样做，我们可以确保管道的所有组成部分之间的适当协同作用，以改进重建，从而促进这项创新技术的临床应用。 et.al.|[2310.14364](http://arxiv.org/abs/2310.14364)|null|\n", "2310.13593": "|**2023-10-20**|**Longer-range Contextualized Masked Autoencoder**|掩模图像建模（MIM）已成为一种很有前途的自监督学习（SSL）策略。MIM预训练通过随机掩蔽一些输入像素并从剩余的像素重建掩蔽的像素，有助于使用编码器-解码器框架来学习强大的表示。然而，由于编码器是用部分像素训练的，MIM预训练可能存在理解长程依赖性的能力低的问题。这种限制可能会阻碍其完全理解多个范围依赖性的能力，导致注意力图中突出显示的区域狭窄，从而可能导致准确性下降。为了减轻这种限制，我们提出了一个自监督学习框架，称为长距离上下文化屏蔽自动编码器（LC-MAE）。LC-MAE有效地利用了对视觉表示的全局上下文理解，同时减少了输入的空间冗余。我们的方法引导编码器从多个视图中的整个像素学习，同时也从稀疏像素学习局部表示。因此，LC-MAE学习了更多的判别表示，导致性能提高，在ImageNet-1K上使用ViT-B以0.6%p的增益实现84.2%的前1级精度。我们将成功归因于增强的预训练方法，奇异值谱和注意力分析证明了这一点。最后，LC-MAE在下游语义分割和细粒度视觉分类任务中实现了显著的性能提升；以及不同的稳健评估指标。我们的代码将公开。 et.al.|[2310.13593](http://arxiv.org/abs/2310.13593)|null|\n", "2310.13373": "|**2023-10-20**|**Single-view 3D reconstruction via inverse procedural modeling**|我们提出了一种通过逆过程建模进行三维重建的方法，并研究了该方法的两种变体。第一种选择是使用遗传算法对输入参数进行拟合。我们展示了我们在树模型（复杂对象）上的工作结果，其中重建是大多数现有方法无法处理的。第二种选择允许我们通过在模因算法、可微分渲染和可微分过程生成器中使用梯度来显著提高精度。在我们的工作中，我们看到了两个主要贡献。首先，我们提出了一种连接可微绘制和逆过程建模的方法。当有少量输入图像可用时（即使是单个图像），这为我们提供了一个比现有方法更准确地重建3D模型的机会。其次，我们将可微和不可微的过程生成器连接在一个框架中，这使我们能够将逆过程建模应用于相当复杂的生成器：当梯度可用时，重建是精确的，当梯度不可用时，重构是近似的，但总是高质量的，没有视觉伪影。 et.al.|[2310.13373](http://arxiv.org/abs/2310.13373)|null|\n", "2310.13263": "|**2023-10-20**|**UE4-NeRF:Neural Radiance Field for Real-Time Rendering of Large-Scale Scene**|神经辐射场（NeRF）是一种新的隐式三维重建方法，显示出巨大的潜力，越来越受到人们的关注。它能够仅从一组照片中重建3D场景。然而，它的实时渲染能力，特别是对于大规模场景的交互式实时渲染，仍然存在很大的局限性。为了应对这些挑战，在本文中，我们提出了一种名为UE4-NeRF的新型神经渲染系统，专门为大规模场景的实时渲染而设计。我们将每个大场景划分为不同的子NeRF。为了表示分割的独立场景，我们通过在场景内构建多个规则八面体来初始化多边形网格，并在训练过程中不断优化多边形面的顶点。从细节层次（LOD）技术中获得灵感，我们针对不同的观察层次训练了不同细节层次的网格。我们的方法与虚幻引擎4（UE4）中的光栅化流水线相结合，以高达43 FPS的帧速率实现了4K分辨率的大规模场景的实时渲染。UE4内的渲染也便于在后续阶段中进行场景编辑。此外，通过实验，我们已经证明我们的方法达到了与最先进的方法相当的渲染质量。项目页面：https://jamchaos.github.io/UE4-NeRF/. et.al.|[2310.13263](http://arxiv.org/abs/2310.13263)|null|\n", "2310.12513": "|**2023-10-19**|**Real space iterative reconstruction for vector tomography (RESIRE-V)**|层析成像对物理、生物和医学产生了重要影响。到目前为止，大多数断层摄影应用都集中在三维标量重建上。然而，在一些关键应用中，需要矢量层析成像来重建三维矢量场，例如电场和磁场。多年来，已经开发了几种矢量层析成像方法。在这里，我们介绍了用于矢量层析成像的REal空间迭代重建的数学基础和算法实现，称为RESIRE-V。RESIRE-V使用多个倾斜系列的投影，并在投影和3D重建之间迭代。每次迭代包括使用Radon变换的前向步骤和使用其转置的后向步骤，然后通过梯度下降更新对象。结合3D支撑约束，该算法迭代地最小化误差度量，该误差度量定义为测量投影和计算投影之间的差。该算法还可以用于细化倾斜角度并进一步改进3D重建。为了验证RESIRE-V，我们首先将其应用于3D磁化矢量场的模拟数据集，该数据集由两个正交倾斜序列组成，每个倾斜序列都有一个缺失的楔块。我们的定量分析表明，重建的磁化矢量场的三个分量与地面实况相一致。然后，我们使用RESIRE-V重建了由三个倾斜序列组成的铁磁超晶格的三维磁化矢量场。我们的三维矢量重建揭示了具有正电荷和负电荷的拓扑磁缺陷的存在。我们期望RESIRE-V可以作为一种通用的矢量层析成像方法被纳入不同的成像模式中。 et.al.|[2310.12513](http://arxiv.org/abs/2310.12513)|**[link](https://github.com/minhpham0309/resire-v)**|\n", "2310.12451": "|**2023-10-19**|**MTS-LOF: Medical Time-Series Representation Learning via Occlusion-Invariant Features**|医疗时间序列数据在医疗保健中不可或缺，为疾病诊断、治疗计划和患者管理提供重要见解。在先进传感器技术的推动下，数据复杂性呈指数级增长，这给数据标签带来了挑战。自我监督学习（SSL）已成为应对这些挑战的一种变革性方法，消除了对大量人工注释的需求。在本研究中，我们介绍了一种新的医学时间序列表示学习框架，称为MTS-LOF。MTS-LOF利用了对比学习和掩蔽自动编码器（MAE）方法的优势，为医学时间序列数据的表示学习提供了一种独特的方法。通过结合这些技术，MTS-LOF通过提供更复杂、上下文丰富的表示，增强了医疗保健应用的潜力。此外，MTS-LOF采用多掩蔽策略来促进遮挡不变特征学习。这种方法允许模型通过屏蔽部分数据来创建数据的多个视图。通过最小化这些屏蔽补丁和完全可见补丁的表示之间的差异，MTS-LOF学会了在医学时间序列数据集中捕获丰富的上下文信息。在不同的医学时间序列数据集上进行的实验结果证明了MTS-LOF优于其他方法。这些发现有望通过改进表征学习来显著增强医疗保健应用。此外，我们的工作深入研究了联合嵌入SSL和MAE技术的集成，揭示了医疗保健数据中时间和结构依赖性之间的复杂相互作用。这种理解至关重要，因为它使我们能够掌握医疗保健数据分析的复杂性。 et.al.|[2310.12451](http://arxiv.org/abs/2310.12451)|**[link](https://github.com/huayuliarizona/mst-lof)**|\n"}, "Diffusion": {"2310.18308": "|**2023-10-27**|**Gen2Sim: Scaling up Robot Learning in Simulation with Generative Models**|一般的机械手需要在不同的环境中学习各种各样的操作技能。目前的机器人训练管道依赖于人类提供动觉演示或对模拟环境进行编程，并为强化学习编码奖励函数。这种人类参与是在不同任务和环境中扩大机器人学习的一个重要瓶颈。我们提出了从生成到模拟（Gen2Sim），这是一种在模拟中扩大机器人技能学习的方法，通过使用大型预先训练的语言和视觉生成模型自动生成3D资产、任务描述、任务分解和奖励函数。我们通过使用图像扩散模型将开放世界的以对象为中心的2D图像提升到3D，并查询LLM来确定合理的物理参数，从而生成用于模拟的3D资产。给定生成的和人类开发的资产的URDF文件，我们提示LLM将这些文件映射到相关的任务描述、时间分解和相应的python奖励函数，以进行强化学习。我们展示了Gen2Sim成功地为不同的长期任务学习策略，其中具有非时间分解奖励函数的强化学习失败。Gen2Sim通过多样化和扩展任务和环境开发，以及通过RL中的时间任务分解促进发现强化学习行为，为在模拟中扩大机器人的强化学习提供了一条可行的途径。我们的工作提供了数百个模拟资产、任务和演示，朝着在模拟中获得完全自主的机器人操纵技能迈出了一步。 et.al.|[2310.18308](http://arxiv.org/abs/2310.18308)|null|\n", "2310.18184": "|**2023-10-27**|**Unsteady evolution of slip and drag in surfactant-contaminated superhydrophobic channels**|认识到表面活性剂可能阻碍超疏水表面（SHSs）产生的减阻，并且表面活性剂浓度可能在空间和时间上波动，我们研究了可溶性表面活性剂在两个SHSs之间的层流压力驱动通道流中的不稳定输运。SHS在流向和翼展方向上是周期性的。我们假设通道长度远长于顺流周期，顺流周期远长于通道高度和展向周期，并且体扩散足够强，跨通道浓度梯度很小。通过结合长波和均化理论，我们导出了表面活性剂通量在通道长度上传输的非定常平流扩散方程，该方程与表面活性剂在单个质体上传输的准稳态平流扩散方程式相耦合。由于通道长度上的扩散通常很小，一阶表面活性剂通量由非线性平流方程控制，我们使用特征法求解该方程。我们预测了表面活性剂团的传播速度，并描述了其通过与SHS相互作用的非线性演化。当表面活性剂吸附并硬化塑性体时，传播速度可能显著低于平均流向速度。因此，较小浓度的表面活性剂的平流速度比较大浓度的更快，因此波浪变陡效应可能导致表面活性剂通量分布中的冲击形成。这些发现揭示了滑移速度的时空演变，并能够预测微通道应用中的动态减阻和有效滑移长度。 et.al.|[2310.18184](http://arxiv.org/abs/2310.18184)|null|\n", "2310.18169": "|**2023-10-27**|**Style Description based Text-to-Speech with Conditional Prosodic Layer Normalization based Diffusion GAN**|在本文中，我们提出了一种基于扩散GAN的方法（Prosecic Diff TTS），以基于风格描述和内容文本作为输入来生成相应的高保真度语音，从而仅在4个去噪步骤内生成语音样本。它利用新的条件韵律层规范化将风格嵌入到基于多头注意力的音素编码器和基于mel声谱图解码器的生成器架构中，以生成语音。风格嵌入是通过在音调、语速、情绪、性别分类等辅助任务上微调预训练的BERT模型来生成的。我们在多扬声器LibriTTS和PromptSpeech数据集上展示了我们提出的架构的有效性，使用了多个量化指标来衡量生成的准确性和MOS。 et.al.|[2310.18169](http://arxiv.org/abs/2310.18169)|null|\n", "2310.18089": "|**2023-10-27**|**Lost in Translation -- Multilingual Misinformation and its Evolution**|虚假信息和虚假信息是数字时代日益严重的威胁，在语言和国界之间迅速传播。本文通过对跨越95种语言的250000多项独特事实核查的分析，调查了多语言错误信息的流行率和动态。首先，我们发现，虽然大多数错误信息声明只经过一次事实核查，但11.7%的错误信息声明（相当于21000多条声明）经过了多次核查。使用事实核查作为错误信息传播的代理，我们发现33%的重复声明跨越了语言界限，这表明一些错误信息渗透了语言障碍。然而，传播模式表现出强烈的同质性，错误信息更有可能在同一语言中传播。为了研究声明随时间的演变和跨语言的突变，我们用多语言句子嵌入和聚类语义相似的声明来表示事实核查。我们分析了连接声明不同版本的连接组件和最短路径，发现声明会随着时间的推移逐渐漂移，并在遍历语言时发生更大的变化。总的来说，这项针对多语言错误信息的新颖调查提供了关键见解。它量化了多余的事实核查工作，确定了一些主张在不同语言之间的扩散，测量了语言的同质性，并对主张的时间和跨语言演变进行了建模。调查结果主张在全球范围内扩大事实核查人员之间的信息共享，同时强调本地化核查的重要性。 et.al.|[2310.18089](http://arxiv.org/abs/2310.18089)|null|\n", "2310.18024": "|**2023-10-27**|**Encounter-based approach to target search problems: a review**|在这篇综述中，我们提出了一种基于相遇的目标搜索方法，其中扩散动力学由粒子的位置和它与给定目标集相遇的次数的联合概率来描述。相遇统计的知识允许人们在目标集上实现各种反应机制，而不是传统的反应方案。我们为三种相关设置制定了这种方法：离散随机行走、具有本体反应的布朗运动和具有表面反应的反射布朗运动。在所有情况下，我们都会讨论这种方法的优点、最近的应用和可能的扩展。 et.al.|[2310.18024](http://arxiv.org/abs/2310.18024)|null|\n", "2310.17994": "|**2023-10-27**|**ZeroNVS: Zero-Shot 360-Degree View Synthesis from a Single Real Image**|我们介绍了一种3D感知扩散模型ZeroNVS，用于野外场景的单图像新颖视图合成。虽然现有的方法是为具有遮罩背景的单个对象设计的，但我们提出了新的技术来解决具有复杂背景的野外多对象场景带来的挑战。具体来说，我们在捕捉以对象为中心、室内和室外场景的混合数据源上训练生成先验。为了解决深度尺度模糊等数据混合问题，我们提出了一种新的相机条件参数化和归一化方案。此外，我们观察到，在360度场景的提取过程中，分数提取采样（SDS）倾向于截断复杂背景的分布，并提出了“SDS锚定”来提高合成新视图的多样性。我们的模型在零样本设置中的DTU数据集上的LPIPS中设置了新的最先进的结果，甚至优于专门在DTU上训练的方法。我们进一步将具有挑战性的Mip-NeRF 360数据集作为单图像新视图合成的新基准，并在该设置中展示了强大的性能。我们的代码和数据位于http://kylesargent.github.io/zeronvs/ et.al.|[2310.17994](http://arxiv.org/abs/2310.17994)|null|\n", "2310.17929": "|**2023-10-27**|**Upper bounds on entropy production in diffusive dynamics**|基于过阻尼Langevin动力学中稳态熵产生率的一个变分表达式，我们导出了各种物理环境下熵生成率的具体上界。对于热环境中由非保守力驱动的粒子，我们证明了仅考虑驱动粒子的统计信息，熵产生率可以是上界。我们利用这一发现来论证，非驱动、被动自由度的存在通常会导致耗散减少。另一个上界只能根据非保守力的方差来获得，这导致了由施加在空间的某个区域中的恒定力驱动的粒子的普遍上界。将我们的结果扩展到连接到多个热浴或具有空间变化的温度和/或迁移率的系统，我们表明热浴之间的温差或温度梯度可以用于熵产生率的上限。我们证明了这些结果中的大多数以一种直接的方式扩展到欠阻尼Langevin动力学，并在三个具体的例子中进行了证明。 et.al.|[2310.17929](http://arxiv.org/abs/2310.17929)|null|\n", "2310.17908": "|**2023-10-27**|**On the Doublet Flux Ratio of Mg II Resonance Lines in and Around Galaxies**|对金属双发射线的观测，特别是对Mg II 27962803的观测，为理解星系及其环星系介质提供了至关重要的信息。本研究探讨了共振散射对球形和圆柱形几何结构中的Mg II双线和恒星连续体的影响。我们的发现表明，在某些情况下，共振散射会导致线的二重通量比和逃逸通量的增加，超过光学薄球形介质中的预期。正如预期的那样，当散射介质是球对称和多尘的时，二重比始终低于本征比。然而，如果散射介质具有圆盘形状，例如面对面星系，并且被正面观察，则二重比被预测为高于2。这些结果可能为了解遥远的、空间上未解决的星系的形状和方向的复杂性提供了有价值的见解。讨论了连续泵浦发射线和扩展介质的重要性，以了解各种观测方面，包括可能低于1.5或高于2的双通量比，以及对称或非对称线剖面。还讨论了扩散的暖中性介质将是MgⅡ发射线的重要来源。 et.al.|[2310.17908](http://arxiv.org/abs/2310.17908)|null|\n", "2310.17848": "|**2023-10-27**|**Boosting Data Analytics With Synthetic Volume Expansion**|合成数据生成是生成人工智能的基石，它通过解决数据稀缺和隐私问题，同时实现前所未有的性能，标志着数据科学的范式转变。随着合成数据越来越突出，与原始数据相比，统计方法在应用于合成数据时的准确性也出现了问题。在本文中，我们介绍了用于分析的合成数据生成框架。该框架对高级模型（如表格扩散和生成预训练的Transformer模型）生成的高保真度合成数据采用统计方法。这些基于原始数据训练的模型，通过相关研究的见解得到了进一步的增强。在这个框架内的一个重要发现是代际效应：统计方法对合成数据的误差最初随着合成数据的增加而减少，但最终可能会增加或趋于平稳。这种现象植根于复制原始数据分布的复杂性，突出了一个“反射点”——由特定误差指标确定的合成数据大小的最佳阈值。通过三个示例性的案例研究——文本的情感分析、结构化数据的预测建模和表格数据中的推理——我们证明了该框架相对于传统框架的有效性。我们强调了它扩大各种统计方法的潜力，包括用于预测和假设检验的梯度增强，从而强调了合成数据生成在数据科学中的变革潜力。 et.al.|[2310.17848](http://arxiv.org/abs/2310.17848)|null|\n", "2310.17844": "|**2023-10-27**|**Adaptive operator learning for infinite-dimensional Bayesian inverse problems**|偏微分方程（PDE）控制的贝叶斯反问题（BIPs）的基本计算问题源于重复正向模型评估的要求。降低这种成本的一种流行策略是，在深度学习的最新进展的推动下，通过使用算子学习的计算高效近似来取代昂贵的模型模拟。然而，直接使用近似模型可能会引入建模误差，加剧反问题的本已不适定性。因此，准确度和效率之间的平衡对于有效实施这些方法至关重要。为此，我们开发了一个自适应算子学习框架，该框架可以通过强制代理在局部区域准确来逐渐减少建模误差。这是通过在反演过程中用贪婪算法选择的自适应点对预先训练的近似模型进行微调来实现的，这只需要几个正向模型评估。为了验证我们的方法，我们采用DeepOnet来构建代理，并分别使用无迹卡尔曼反演（UKI）来近似BIPs的解。此外，我们使用UKI的框架给出了线性情况下的严格收敛保证。我们在几个基准上测试了该方法，包括达西流、热源反演问题和反应扩散问题。数值结果表明，该方法在保持反演精度的同时，可以显著降低计算成本。 et.al.|[2310.17844](http://arxiv.org/abs/2310.17844)|null|\n"}, "NeRF": {"2310.15907": "|**2023-10-24**|**LiCROM: Linear-Subspace Continuous Reduced Order Modeling with Neural Fields**|线性降阶建模（ROM）通过使用简化的运动学表示来近似系统的行为，从而简化了复杂的模拟。通常，ROM在使用特定空间离散化创建的输入模拟上进行训练，然后用于使用相同的离散化加速模拟。这种离散化依赖性是有限制的。独立于特定的离散化将提供在训练数据中混合和匹配网格分辨率、连通性和类型（四面体、六面体）的灵活性；以在训练过程中看不到的新颖离散化来加速模拟；以及加速在时间上或参数化地改变离散化的自适应模拟。我们提出了一种灵活的、独立于离散化的降阶建模方法。与传统ROM一样，我们将配置表示为位移场的线性组合。与传统的ROM不同，我们的位移场是从参考域上的每个点到相应位移矢量的连续映射；这些映射被表示为隐式神经场。使用线性连续ROM（LiCROM），我们的训练集可以包括经历多个加载条件的多个几何体，与它们的离散化无关。这为降阶建模的新应用打开了大门。我们现在可以加速在运行时修改几何体的模拟，例如通过切割、打孔，甚至交换整个网格。我们还可以加速对训练中看不见的几何形状的模拟。我们演示了一次性泛化，在单个几何体上进行训练，然后模拟各种看不见的几何体。 et.al.|[2310.15907](http://arxiv.org/abs/2310.15907)|null|\n", "2310.07522": "|**2023-10-12**|**S4C: Self-Supervised Semantic Scene Completion with Neural Fields**|三维语义场景理解是计算机视觉中的一个基本挑战。它使移动代理能够自主规划和导航任意环境。SSC将这一挑战形式化为从场景的稀疏观测中联合估计密集的几何结构和语义信息。当前的SSC方法通常基于聚合的激光雷达扫描在3D地面实况上进行训练。这一过程依赖于特殊的传感器和手工注释，这些传感器和注释成本高昂且规模不大。为了克服这个问题，我们的工作提出了第一种称为S4C的SSC自监督方法，该方法不依赖于3D地面实况数据。我们提出的方法可以从单个图像重建场景，并且只依赖于训练期间从现成的图像分割网络生成的视频和伪分割地面实况。与使用离散体素网格的现有方法不同，我们将场景表示为隐式语义场。该公式允许查询相机截锥体内的任何点的占用率和语义类。我们的架构是通过基于渲染的自监督损失进行训练的。尽管如此，我们的方法实现了接近于完全监督的最先进方法的性能。此外，我们的方法表现出强大的泛化能力，可以为遥远的视点合成准确的分割图。 et.al.|[2310.07522](http://arxiv.org/abs/2310.07522)|null|\n", "2310.04787": "|**2023-10-07**|**HI-SLAM: Monocular Real-time Dense Mapping with Hybrid Implicit Fields**|在这封信中，我们提出了一个基于神经场的实时单目映射框架，用于精确和密集的同时定位和映射（SLAM）。最近的神经映射框架显示出有希望的结果，但依赖于RGB-D或姿势输入，或者无法实时运行。为了解决这些局限性，我们的方法将密集SLAM与神经隐式场相结合。具体来说，我们的密集SLAM方法运行并行跟踪和全局优化，而基于神经场的映射是基于最新的SLAM估计逐步构建的。为了有效地构造神经场，我们采用了多分辨率网格编码和符号距离函数（SDF）表示。这使我们能够始终保持地图的最新状态，并通过循环关闭立即适应全球更新。为了全局一致性，我们提出了一种有效的基于Sim（3）的姿态图束调整（PGBA）方法来运行在线闭环并减轻姿态和尺度漂移。为了进一步提高深度精度，我们结合了学习的单目深度先验。我们提出了一种新的深度和尺度联合调整（JDSA）模块来解决深度先验中固有的尺度模糊性。对合成和真实世界数据集的广泛评估验证了我们的方法在准确性和地图完整性方面优于现有方法，同时保持了实时性能。 et.al.|[2310.04787](http://arxiv.org/abs/2310.04787)|null|\n", "2310.03861": "|**2023-10-05**|**Variational Barycentric Coordinates**|我们提出了一种变分技术来优化广义重心坐标，与现有模型相比，该技术提供了额外的控制。先前的工作使用网格或闭式公式表示重心坐标，在实践中限制了目标函数的选择。相反，我们使用神经场直接参数化连续函数，该函数将多面体内部的任何坐标映射到其重心坐标。这个公式是通过我们对重心坐标的理论表征实现的，这使我们能够构建将有效坐标的整个函数类参数化的神经场。我们使用各种目标函数展示了我们模型的灵活性，包括多重光滑性和变形感知能量；作为补充，我们还提出了数学上合理的方法来测量和最小化目标，如不连续神经场的总变化。我们提供了一个实用的加速策略，对我们的算法进行了彻底的验证，并展示了几个应用。 et.al.|[2310.03861](http://arxiv.org/abs/2310.03861)|null|\n", "2310.03624": "|**2023-10-05**|**High-Degrees-of-Freedom Dynamic Neural Fields for Robot Self-Modeling and Motion Planning**|机器人自模型是机器人物理形态的任务不可知表示，在没有经典几何运动学模型的情况下，可用于运动规划任务。特别是，当后者难以设计或机器人的运动学发生意外变化时，人类自由的自我建模是真正自主智能体的必要特征。在这项工作中，我们利用神经场使机器人能够将其运动学自建模为仅从带有相机姿势和配置的2D图像中学习的神经隐式查询模型。这使得比依赖于深度图像或几何知识的现有方法具有更大的适用性。为此，除了课程数据采样策略外，我们还提出了一种新的基于编码器的神经密度场架构，用于高自由度（DOF）条件下的动态对象中心场景。在7自由度机器人测试装置中，学习的自模型实现了机器人工作空间尺寸2%的倒角-L2距离。作为一个示例性的下游应用程序，我们展示了该模型在运动规划任务中的能力。 et.al.|[2310.03624](http://arxiv.org/abs/2310.03624)|null|\n", "2310.01140": "|**2023-10-02**|**Neural Processing of Tri-Plane Hybrid Neural Fields**|在用于存储和通信3D数据的神经场的吸引人的特性的驱动下，直接处理它们以解决分类和零件分割等任务的问题已经出现，并在最近的工作中进行了研究。早期的方法使用由在整个数据集上训练的共享网络参数化的神经场，实现了良好的任务性能，但牺牲了重建质量。为了改进后者，后来的方法侧重于参数化为大型多层感知器（MLP）的单个神经场，然而，由于权重空间的高维性、固有的权重空间对称性和对随机初始化的敏感性，这些神经元场的处理具有挑战性。因此，结果明显不如通过处理显式表示（例如点云或网格）所获得的结果。与此同时，混合表示，特别是基于三平面的混合表示，已经成为实现神经场的一种更有效的替代方案，但其直接处理尚未得到研究。在本文中，我们证明了三平面离散数据结构编码了丰富的信息，标准的深度学习机器可以有效地处理这些信息。我们定义了一个广泛的基准，涵盖了一组不同的字段，如占用率、有符号/无符号距离，以及首次定义的辐射字段。在处理具有相同重建质量的字段时，我们实现的任务性能远远优于处理大型MLP的框架，并且首次几乎与处理显式表示的架构不相上下。 et.al.|[2310.01140](http://arxiv.org/abs/2310.01140)|**[link](https://github.com/CVLAB-Unibo/triplane_processing)**|\n", "2309.15977": "|**2023-09-27**|**Neural Acoustic Context Field: Rendering Realistic Room Impulse Response With Neural Fields**|房间脉冲响应（RIR）测量声音在环境中的传播，对于合成给定环境下的高保真音频至关重要。一些先前的工作已经提出将RIR表示为声音发射器和接收器位置的神经场函数。然而，这些方法没有充分考虑音频场景的声学特性，导致性能不令人满意。这封信提出了一种新的神经声学上下文场方法，称为NACF，通过利用多个声学上下文（如几何结构、材料特性和空间信息）来参数化音频场景。在RIR的独特性质，即时间不光滑性和单调能量衰减的驱动下，我们设计了一个时间相关模块和多尺度能量衰减准则。实验结果表明，NACF的性能显著优于现有的基于字段的方法。请访问我们的项目页面了解更多定性结果。 et.al.|[2309.15977](http://arxiv.org/abs/2309.15977)|null|\n", "2309.15848": "|**2023-09-27**|**SHACIRA: Scalable HAsh-grid Compression for Implicit Neural Representations**|隐式神经表示（INR）或神经场已成为编码多媒体信号（如图像和辐射场）同时保持高质量的流行框架。最近，Instant NGP提出的可学习特征网格通过用特征向量的多分辨率查找表和更小的神经网络取代大型神经网络，在训练和INR采样方面实现了显著的加速。然而，这些功能网格是以大量内存消耗为代价的，这可能是存储和流应用程序的瓶颈。在这项工作中，我们提出了SHACIRA，这是一个简单而有效的任务无关框架，用于压缩这种特征网格，而不需要额外的事后修剪/量化阶段。我们用量化的潜在权重对特征网格进行重新参数化，并在潜在空间中应用熵正则化，以在各个领域实现高水平的压缩。在由图像、视频和辐射场组成的不同数据集上的定量和定性结果表明，我们的方法优于现有的INR方法，而不需要任何大型数据集或特定领域的启发式方法。我们的项目页面可在http://shacira.github.io。 et.al.|[2309.15848](http://arxiv.org/abs/2309.15848)|null|\n", "2309.15426": "|**2023-09-27**|**NeuRBF: A Neural Fields Representation with Adaptive Radial Basis Functions**|我们提出了一种新型的神经场，它使用一般的径向基来表示信号。现有技术的神经领域通常依赖于用于存储局部神经特征的基于网格的表示和用于在连续查询点处插值特征的N维线性核。它们的神经特征的空间位置固定在网格节点上，不能很好地适应目标信号。相反，我们的方法建立在具有灵活内核位置和形状的通用径向基上，这些径向基具有更高的空间自适应性，可以更紧密地拟合目标信号。为了进一步提高径向基函数的信道容量，我们建议将它们与多频率正弦函数组合。该技术将径向基扩展到不同频带的多个傅立叶径向基，而不需要额外的参数，便于细节的表示。此外，通过将自适应径向基与基于网格的径向基相结合，我们的混合组合继承了自适应性和插值平滑性。我们精心设计了加权方案，使径向基有效地适应不同类型的信号。我们在2D图像和3D符号距离场表示上的实验证明了我们的方法比现有技术更高的精度和紧凑性。当应用于神经辐射场重建时，我们的方法实现了最先进的渲染质量，模型大小小，训练速度相当。 et.al.|[2309.15426](http://arxiv.org/abs/2309.15426)|**[link](https://github.com/oppo-us-research/NeuRBF)**|\n", "2309.15164": "|**2023-09-29**|**3D Reconstruction with Generalizable Neural Fields using Scene Priors**|由于神经领域的最新进展，高保真3D场景重建得到了实质性的推进。然而，大多数现有的方法为每个单独的场景从头开始训练单独的网络。这是不可扩展的，效率低下，并且在视图有限的情况下无法产生良好的结果。虽然基于学习的多视图立体方法在一定程度上缓解了这一问题，但它们的多视图设置使其扩展和广泛应用的灵活性降低。相反，我们引入了结合场景先验（NFP）的训练可推广神经场。NFP网络将任何单视图RGB-D图像映射为带符号的距离和辐射值。在没有融合模块的情况下，可以通过合并体积空间中的各个帧来重建完整的场景，这提供了更好的灵活性。场景先验可以在大规模数据集上进行训练，从而能够快速适应具有较少视图的新场景的重建。NFP不仅展示了SOTA场景重建的性能和效率，而且还支持单图像新视图合成，这在神经领域还没有得到充分的探索。更多定性结果可在以下网站获得：https://oasisyang.github.io/neural-prior et.al.|[2309.15164](http://arxiv.org/abs/2309.15164)|null|\n"}}